{"posts":[{"title":"基本設計記事","text":"基本設計について記事 基本設計 とは■基本設計要件定義のフェーズで作成された要件定義書をもとにして、システムの骨組みを設計する工程です。完成した基本設計書で実装が進められていくため、要件を満たしているか、また、システムがどのようなものであるかを考慮して設計していきます。 基本設計の工程では、以下の成果物を作成していきます。・画面遷移図・画面設計書・DB設計書・API設計書 ■DB とはDataBaseの略。データの基地(data + base)を意味します。 データを保管する貯蔵庫の役割を果たすもので、アプリケーションを利用するうえで必要となるデータの集まりを指します。 ■API とは「Application Programming Interface」の略。それぞれの単語の意味は以下の通りです。・Application(アプリケーション)：パソコンやスマホの中で動くソフト・Programming(プログラミング)：パソコンやスマホに実行させる指示を出す・Interface(インターフェース) ：接続部分や接触する箇所 それぞれの単語を組み合わせると、「アプリケーションとプログラムをつなぐもの」という意味になります。つまりAPIとは、いくつかのアプリケーションやソフトウェア同士が情報をやり取りする際に使用されるプログラミング上の窓口と理解しておくとよいでしょう。 ■APIの動作イメージAPI利用者が、事前に定められた形式に従って使いたい機能や情報をまとめてリクエスト（要求）します。それに対し、API側はリクエストを受け取ると、送信された条件を処理してレスポンス（応答）を返します。 リクエストの定められた形式については、APIサービスの提供者側が必要な情報をまとめて定義し、利用者に提示します。 面遷移図画面設計書API設計書DB設計書","link":"/base-design/"},{"title":"HexoのIcarusテーマを使ってブログを構築","text":"はじめに私は自分が記憶力があまり良くないことを知っていますので、何かを書いて記録するのが好きです。これは一種の知識の復習とも言えます。 TODO 添加图床 音乐播放插件 如何禁止复制页面中的文本 如何添加一个翻译按钮 seo搜索引擎优化 添加一个可以隐藏右边栏目的按钮，点击之后只显示文章，可以更加专注阅读 細かい設定 主页也文章页面调整 关于分享组件 评论插件 图片插件 文章排版设置 text licenses hide 在个人页面头部加入 aritcle: ? licenses 标签和目录的写法 12345678910111213141516171819tags: - 123 - 456tags: [123, 456]多标签写法，这2种都是一样的效果，用哪个都可以，建议使用列表[]式，直观清晰。这是默认的写法，给文章添加一个分类。categories: 123这会将文章分类123/456子分类目录下。categories: [123, 456]这会将文章分类到123/456子分类目录下。categories: - 123 - 456多标签写法，文章被分类到123、456以及123的自分类789这3个分类下面，官方指定写法。categories: - [123] - [456] - [123, 789] 1. プログラマーがブログを書くときにタグとカテゴリを柔軟に使用する方法プログラマがブログを書くとき、タグとカテゴリを使用すると、読者が興味深いコンテンツをより迅速に見つけられるようになり、非常に便利です。以下にいくつかの提案を示します。 タグを使用する: 各ブログ投稿を、投稿コンテンツのキーワードまたはトピックである関連タグに関連付けます。 タグは簡潔かつ関連性を保ち、あまり多くのタグを使用しないでください。通常、記事ごとに 2 ～ 5 個のタグが適切です。 タグには技術用語、プログラミング言語、フレームワーク名、質問の種類などを使用できるため、読者は興味やニーズに基づいてフィルタリングできます。 カテゴリを使用する: ブログ投稿をトピックまたはコンテンツごとに分類し、各カテゴリが関連する投稿のグループを表します。 カテゴリには、技術分野、プロジェクトの種類、プログラミング言語、アプリケーション シナリオなどが含まれます。分類構造は、ブログの内容と読者のニーズに応じて設計されます。 読者の閲覧とナビゲーションを容易にするために、カテゴリの過度の細分化を避け、カテゴリの階層を明確に保ちます。 柔軟な使用: ブログを書くときは、記事の内容を説明する適切なタグとカテゴリを選択し、必要に応じて新しいタグとカテゴリを追加します。 タグとカテゴリは、読者のフィードバックや閲覧状況に基づいて調整および最適化され、読者の興味やニーズにより沿ったものにすることができます。 タグ クラウドまたはカテゴリ ナビゲーションを使用してタグとカテゴリを読者に表示し、読者が興味のあるコンテンツをすぐに見つけられるようにすることができます。 一貫性を維持する: 同じタグとカテゴリの命名規則を使用して、ブログ全体でタグとカテゴリの一貫性を保ちます。 複数の作成者またはチーム メンバーがブログを共同執筆する場合、統一されたタグとカテゴリの管理戦略を開発して、ブログ全体の一貫性と標準化を確保できます。 タグとカテゴリを柔軟に使用することで、プログラマはブログのコンテンツをより適切に整理および管理し、読者の読書体験を向上させ、興味のあるコンテンツをより簡単に見つけられるようにし、技術的なトピックの理解と応用を深めることができます。 12345678910111213141516写博客时，使用 tags（标签）和 category（分类）是非常有用的，可以更快速地找到感兴趣的内容。1. 使用 Tags： - 将每篇博客文章与相关的标签关联起来，这些标签应该是文章内容的关键词或主题。 - 保持标签的简洁和相关性，不要使用太多的标签，一般每篇文章使用 2 到 5 个标签比较合适。 - 标签可以是技术术语、编程语言、框架名称、问题类型等，以便读者可以根据自己的兴趣和需求进行筛选。2. 使用 Category： - 将博客文章按照主题或内容进行分类，每个分类代表一组相关的文章。 - 分类可以是技术领域、项目类型、编程语言、应用场景等，根据博客的内容和读者的需求来设计分类结构。 - 避免过度细分分类，保持分类的层次结构清晰，方便读者浏览和导航。3. 灵活运用： - 在撰写博客时，选择适当的标签和分类来描述文章内容，并根据需要添加新的标签和分类。 - 可以根据读者的反馈和浏览情况来调整和优化标签和分类，使其更符合读者的兴趣和需求。 - 可以使用标签云或分类导航等方式将标签和分类展示给读者，方便他们快速找到感兴趣的内容。4. 一貫性を維持する: - 在整个博客中保持标签和分类的一致性，使用相同的标签和分类命名规范。 - 如果有多个作者或团队成员共同撰写博客，可以制定统一的标签和分类管理策略，确保博客整体的一致性和规范性。 サンプルCategory: テクノロジーカテゴリー tags: front JavaScript/React/Vue/Node.js backend Java/Kotlin/Spring/RubyOnRails/MVC/BFF db Oracle/MySQL/MongoDB/PostgreSQL/redis cloud&infra Docker/AWS/K8S/CI-CD others 雑記/フロントエンド front-end/バックエンド back-end/作業メモ working-note/勉強ノート study-note/振り返り/筋トレ ウォーターフォール 要件定義/基本設計/詳細設計/実装/テスト/リリース マークダウン Markdowntitlecode","link":"/hexo-create-blog/"},{"title":"バージョン管理ツール","text":"はじめにGitgit使用技巧 SVNTFS","link":"/version-control-toll/"},{"title":"日本のIT職記録","text":"本記事についてxxx","link":"/japan-it-working-memo/"},{"title":"CI&#x2F;CD ハンズオン","text":"本記事についてはじめに","link":"/cicd-handon/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"markdown","slug":"markdown","link":"/tags/markdown/"},{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"Git","slug":"Git","link":"/tags/Git/"},{"name":"work","slug":"work","link":"/tags/work/"},{"name":"設計","slug":"設計","link":"/tags/%E8%A8%AD%E8%A8%88/"}],"categories":[{"name":"作業","slug":"作業","link":"/categories/%E4%BD%9C%E6%A5%AD/"},{"name":"作業メモ","slug":"作業/作業メモ","link":"/categories/%E4%BD%9C%E6%A5%AD/%E4%BD%9C%E6%A5%AD%E3%83%A1%E3%83%A2/"}],"pages":[{"title":"自己紹介","text":"","link":"/about/index.html"}]}