{"posts":[{"title":"AWSラーニングノート","text":"aws関連のチュートリアルや公式サイトを見てより良いですが、インターネットの残りの部分はあまりにも断片的ですが、公式サイトのホワイトペーパーは、英語の多くは、唯一の勉強に多くの時間を費やすことができます。 本記事について AWSとは何か、その具体的サービスの紹介 AWS（Amazon Web Services）は、Amazonが提供するクラウドコンピューティングプラットフォームであり、個人、企業、および組織にさまざまなクラウドサービスを提供しています。AWSのサービスは、グローバルに配置されたデータセンターネットワークを基盤にしており、顧客は必要なサービスを柔軟に利用することができます。これにより、従来のインフラ構築や管理の複雑さとコストを回避することができます。 AWSは、コンピューティング、ストレージ、データベース、機械学習、インターネット・オブ・シングス（IoT）、セキュリティ、ネットワーキング、開発ツールなど、さまざまな領域で多様なサービスを提供しています。以下は、主なAWSのサービスの一部です： コンピューティングサービス Elastic Compute Cloud（EC2）：可変長の仮想サーバーインスタンスを提供し、必要に応じて計算リソースを拡張または縮小できます。 AWS Lambda：サーバーレスコンピューティングサービスで、サーバーの管理なしにコードを実行し、実際の実行時間に応じて課金されます。 ストレージサービス Simple Storage Service（S3）：高度にスケーラブルで耐久性のあるオブジェクトストレージサービスで、画像、動画、文書などあらゆるデータを保存・取得できます。大量のデータの格納やバックアップに適しています。 Elastic Block Store（EBS）：EC2インスタンスに永続的なブロックレベルのストレージを提供し、データベース、アプリケーション、およびオペレーティングシステムに使用されます。 データベースサービス Amazon Relational Database Service（RDS）：リレーショナルデータベースの簡単なセットアップと管理を提供します。MySQL、PostgreSQL、Microsoft SQL Serverなど、複数のリレーショナルデータベースをサポートしています。RDSはデータベースのセットアップと管理を簡素化し、高可用性と自動バックアップを提供します。 Amazon DynamoDB：全管理型のNoSQLデータベースサービスで、高度にスケーラブルで低遅延のパフォーマンスを提供します。 ネットワーキングサービス Virtual Private Cloud（VPC）：AWS内でカスタム仮想ネットワーク環境を作成し、アプリケーションリソースを隔離・保護する機能を提供します。 Elastic Load Balancing（ELB）：負荷分散サービスで、トラフィックを複数のEC2インスタンスに自動的に分散し、アプリケーションの信頼性とスケーラビリティを向上させます。 コンテンツ配信サービス Amazon CloudFrontは、高速でセキュアなコンテンツ配信ネットワークを提供します。 インターネットオブシングス（IoT）サービス： AWS IoT Core：大量の物联网デバイスとの接続、管理、データ収集をサポートする包括的なサービスです。IoTデバイスの接続、管理、およびデータ収集を実現します。大規模な物联网デバイスからのデータの接続、管理、収集をサポートする包括的な物联网サービスです。 セキュリティサービス AWS Identity and Access Management（IAM）：ユーザー、グループ、および権限の管理に使用され、AWSリソースへのアクセスを制御します。 AWS Key Management Service（KMS）：暗号化キーの作成と管理を支援し、データの安全な保管と転送を確保します。 機械学習サービス Amazon Machine Learning（Amazon ML）やAmazon SageMakerなど、機械学習モデルの構築と展開をサポートします。 人工智能サービス Amazon Polly：テキストを音声に変換するサービスで、自然な音声を提供します。 Amazon Rekognition：画像とビデオの分析サービスで、オブジェクト、シーン、および顔を認識・分析します。 これらのサービスは、AWSの一部であり、さまざまなビジネスニーズに合わせて使用できる多様なサービスが提供されています。AWSの利用により、ユーザーは高度にスケーラブルなアプリケーションを迅速に構築し、運用コストを削減し、イノベーションとビジネスの発展に集中できるようになります。 その他 Amazon DynamoDB 是什么 Amazon DynamoDB 是亚马逊公司提供的一种全托管的 NoSQL 数据库服务。它被设计用于处理大规模的分布式应用程序，提供了高可用性、高性能和可扩展性。 DynamoDB 是一个键值存储系统，可以存储和检索数据，并且可以根据需要进行自动扩展。它支持结构化数据、半结构化数据和文档数据，并提供了强大的查询功能。DynamoDB 以分区和复制的方式来实现数据的可扩展性和高可用性，它将数据分布在多个分区中，并将数据副本复制到多个可用区域中，从而确保数据的可靠性和持久性。 DynamoDB 提供了灵活的数据模型，允许开发人员根据应用程序的需求定义数据结构。它支持快速读取和写入操作，并能够处理大量的并发请求。此外，DynamoDB 还提供了一些高级功能，如自动缓存、自动备份和恢复、数据流和触发器等。 使用 DynamoDB，开发人员可以构建具有低延迟、高可扩展性和高可靠性的应用程序。它适用于各种应用场景，包括 Web 应用程序、移动应用程序、游戏、物联网设备和大数据分析等。 需要注意的是，DynamoDB 是亚马逊的商业产品，使用它可能需要支付相应的费用。详细的定价信息可以在亚马逊的官方网站上找到。 公司每月对 AWS 基础设施进行维护。在这些维护操作期间，公司需要在多个 AWS 区域轮换其 Amazon RDS for MySQL 数据库凭证。 哪种解决方案能够以最少的运营开销满足这些要求？ 对于在多个 AWS 区域轮换 Amazon RDS for MySQL 数据库凭证，以下是一种解决方案，以最少的运营开销满足要求： 使用 AWS Secrets Manager 进行凭证管理和轮换。AWS Secrets Manager 是一项托管服务，用于安全地存储和管理敏感凭证，如数据库密码、API 密钥和其他访问凭证。 以下是步骤： 创建 AWS Secrets Manager 密钥：在 AWS Secrets Manager 中创建一个“Secret”，将 Amazon RDS for MySQL 数据库凭证作为密钥的值存储在该“Secret”中。 配置轮换策略：AWS Secrets Manager 允许你配置轮换策略，定义凭证何时应该轮换。你可以根据需要设置一个每月轮换的计划。 配置自动轮换：为了满足自动轮换要求，可以使用 AWS Lambda 来触发轮换操作。你可以编写一个 Lambda 函数，该函数在预定的时间间隔内触发并调用 AWS Secrets Manager API，以更新存储在“Secret”中的数据库凭证。 配置多个 AWS 区域：AWS Secrets Manager 支持多个 AWS 区域。你可以在不同的区域中创建相同的“Secret”，并在每个区域中使用相应的数据库凭证。 通过使用 AWS Secrets Manager 进行凭证管理和轮换，你可以在不同的 AWS 区域中轮换数据库凭证，同时保持凭证的安全性和自动化。这种解决方案可以减少手动操作和管理开销，提供一致和可靠的凭证轮换过程。 什么是轮换，为什么要轮换 在安全和凭证管理的上下文中，&quot;轮换&quot;是指定期更换敏感凭证（如密码、密钥、令牌等）的过程。这是一种安全最佳实践，旨在减少潜在的安全风险和减轻凭证泄露的影响。 以下是为什么要进行凭证轮换的主要原因： 增加安全性：通过定期更换凭证，可以降低被未经授权访问或滥用的风险。如果凭证不断变化，即使旧凭证被泄露，攻击者也无法持续访问和利用系统。 响应潜在威胁：如果存在潜在的威胁或怀疑凭证已经被泄露，及时轮换凭证可以防止攻击者进一步利用已获取的凭证。 遵循最小权限原则：凭证轮换是将最小权限原则应用于安全凭证管理的一种方式。通过定期更换凭证，可以限制长期凭证的使用，并确保只有授权用户拥有有效的凭证。 合规要求：许多合规标准和法规要求定期更换敏感凭证。通过执行凭证轮换，可以满足合规性要求，并为审计和合规性审核提供证据。 恢复数据的保护：对于数据加密场景，定期更换加密密钥可以提高数据的安全性。如果加密密钥被泄露，更换密钥可以防止对已加密数据的未经授权访问。 凭证轮换是一项重要的安全实践，确保敏感凭证的安全性和完整性。它应该作为整体安全策略中的一部分，并与其他安全措施结合使用，以提供最佳的安全保护。","link":"/aws-learning-note/"},{"title":"CI&#x2F;CD ハンズオン","text":"本記事について はじめに","link":"/cicd-handson/"},{"title":"HexoのIcarusテーマを使ってブログを構築","text":"はじめに 私は自分が記憶力があまり良くないことを知っていますので、何かを書いて記録するのが好きです。 これは一種の知識の復習とも言えます。 チャンスは、心の準備のできている人のところにやってくる。 TODO 让博客阅读页面更宽 双语切换按钮追加 添加一个可以隐藏右边栏目的按钮，点击之后只显示文章，可以更加专注阅读 如何无缝切换到其他设备编写博客 文章页面隐藏个人信息 如何禁止复制页面中的文本 音乐播放插件 seo搜索引擎优化 ok blogについて 本を読む記事 Amazon web service業務システム設計移行ガイド AWS認定 クラウドプラクティショナー 项目 设计 开发 上线 部署的流程记录 项目中用过的开发工具和相关软件和使用方法速记 細かい設定 渲染器升级 将自带的 hexo-renderer-marked 更换为功能更加强大，渲染速度更快的 hexo-renderer-markdown-it 渲染器 【Hexo】选择更高级的Markdown渲染器 添加图床，存储图片 jsDelivr CDN 对 Github 图床进行加速 图库目录设置 PostPic/Cover/ PostPic/Thunmail/ DailyLife/ Program/ Reading/ Anime/ Others/ 文章页面调整 主页以及文章页布局 文章样式 h1~h6 分享组件 评论插件 其他 图片插件 文章排版设置 text licenses hide 在个人页面头部加入 aritcle: ? licenses 标签和目录的写法 12345678910111213141516171819tags: - 123 - 456tags: [123, 456]多标签写法，这2种都是一样的效果，用哪个都可以，建议使用列表[]式，直观清晰。这是默认的写法，给文章添加一个分类。categories: 123这会将文章分类123/456子分类目录下。categories: [123, 456]这会将文章分类到123/456子分类目录下。categories: - 123 - 456多标签写法，文章被分类到123、456以及123的自分类789这3个分类下面，官方指定写法。categories: - [123] - [456] - [123, 789] プログラマーがブログを書くときにタグとカテゴリを柔軟に使用する方法 プログラマがブログを書くとき、タグとカテゴリを使用すると、読者が興味深いコンテンツをより迅速に見つけられるようになり、非常に便利です。以下にいくつかの提案を示します。 タグを使用する: 各ブログ投稿を、投稿コンテンツのキーワードまたはトピックである関連タグに関連付けます。 タグは簡潔かつ関連性を保ち、あまり多くのタグを使用しないでください。通常、記事ごとに 2 ～ 5 個のタグが適切です。 タグには技術用語、プログラミング言語、フレームワーク名、質問の種類などを使用できるため、読者は興味やニーズに基づいてフィルタリングできます。 カテゴリを使用する: ブログ投稿をトピックまたはコンテンツごとに分類し、各カテゴリが関連する投稿のグループを表します。 カテゴリには、技術分野、プロジェクトの種類、プログラミング言語、アプリケーション シナリオなどが含まれます。分類構造は、ブログの内容と読者のニーズに応じて設計されます。 読者の閲覧とナビゲーションを容易にするために、カテゴリの過度の細分化を避け、カテゴリの階層を明確に保ちます。 柔軟な使用: ブログを書くときは、記事の内容を説明する適切なタグとカテゴリを選択し、必要に応じて新しいタグとカテゴリを追加します。 タグとカテゴリは、読者のフィードバックや閲覧状況に基づいて調整および最適化され、読者の興味やニーズにより沿ったものにすることができます。 タグ クラウドまたはカテゴリ ナビゲーションを使用してタグとカテゴリを読者に表示し、読者が興味のあるコンテンツをすぐに見つけられるようにすることができます。 一貫性を維持する: 同じタグとカテゴリの命名規則を使用して、ブログ全体でタグとカテゴリの一貫性を保ちます。 複数の作成者またはチーム メンバーがブログを共同執筆する場合、統一されたタグとカテゴリの管理戦略を開発して、ブログ全体の一貫性と標準化を確保できます。 プログラマがブログのコンテンツを整理し、管理し、読者の読書体験を向上させるために、タグとカテゴリを柔軟に活用することが重要です。これにより、興味のあるコンテンツを簡単に見つけられ、技術的なトピックの理解と応用を深めることができます。具体的な記事の内容やテーマに応じて、適切なカテゴリーやタグを柔軟に選択し、読者が興味のある情報にすぐにアクセスできるようにします。同時に、タグとカテゴリの一貫性を保ち、標準化することは、ブログの読みやすさと検索性の向上に役立ちます。 &nbsp;中国語写博客时，使用 tags（标签）和 category（分类）是非常有用的，可以更快速地找到感兴趣的内容。 使用 Tags： 将每篇博客文章与相关的标签关联起来，这些标签应该是文章内容的关键词或主题。 保持标签的简洁和相关性，不要使用太多的标签，一般每篇文章使用 2 到 5 个标签比较合适。 标签可以是技术术语、编程语言、框架名称、问题类型等，以便读者可以根据自己的兴趣和需求进行筛选。 使用 Category： 将博客文章按照主题或内容进行分类，每个分类代表一组相关的文章。 分类可以是技术领域、项目类型、编程语言、应用场景等，根据博客的内容和读者的需求来设计分类结构。 避免过度细分分类，保持分类的层次结构清晰，方便读者浏览和导航。 灵活运用： 在撰写博客时，选择适当的标签和分类来描述文章内容，并根据需要添加新的标签和分类。 可以根据读者的反馈和浏览情况来调整和优化标签和分类，使其更符合读者的兴趣和需求。 可以使用标签云或分类导航等方式将标签和分类展示给读者，方便他们快速找到感兴趣的内容。 一貫性を維持する: 在整个博客中保持标签和分类的一致性，使用相同的标签和分类命名规范。 如果有多个作者或团队成员共同撰写博客，可以制定统一的标签和分类管理策略，确保博客整体的一致性和规范性。 中国語12345678910111213141516写博客时，使用 tags（标签）和 category（分类）是非常有用的，可以更快速地找到感兴趣的内容。1. 使用 Tags： - 将每篇博客文章与相关的标签关联起来，这些标签应该是文章内容的关键词或主题。 - 保持标签的简洁和相关性，不要使用太多的标签，一般每篇文章使用 2 到 5 个标签比较合适。 - 标签可以是技术术语、编程语言、框架名称、问题类型等，以便读者可以根据自己的兴趣和需求进行筛选。2. 使用 Category： - 将博客文章按照主题或内容进行分类，每个分类代表一组相关的文章。 - 分类可以是技术领域、项目类型、编程语言、应用场景等，根据博客的内容和读者的需求来设计分类结构。 - 避免过度细分分类，保持分类的层次结构清晰，方便读者浏览和导航。3. 灵活运用： - 在撰写博客时，选择适当的标签和分类来描述文章内容，并根据需要添加新的标签和分类。 - 可以根据读者的反馈和浏览情况来调整和优化标签和分类，使其更符合读者的兴趣和需求。 - 可以使用标签云或分类导航等方式将标签和分类展示给读者，方便他们快速找到感兴趣的内容。4. 一貫性を維持する: - 在整个博客中保持标签和分类的一致性，使用相同的标签和分类命名规范。 - 如果有多个作者或团队成员共同撰写博客，可以制定统一的标签和分类管理策略，确保博客整体的一致性和规范性。 サンプル Category: テクノロジー バックエンド/フロントエンド/インフラ/設計/基礎学習 ライフスタイル 思い/ジャーナル/日本語学習/日本の生活/趣味/ 作業 仕事ノート/勉強ノート/試験の準備/ その他 ランダムな考え/サイクリング/歌詞/ tags: front JavaScript/React/Vue/CSS/HTML/BootStrap/Jquery/Postman/Swagger backend Java/Kotlin/Spring/RubyOnRails/MVC/BFF/Node.js/JUnit5/Mockito db Oracle/MySQL/MongoDB/PostgreSQL/Redis/DB/SQL cloud&infra Docker/AWS/Azure/Kubernetes/CI-CD/Infra others Frontend/Backend/Music/Cycling/Hexo/MarkDown/Git/振り返り/筋トレ/雑記/EN/JP/CN/TOEIC/試験メモ/読書メモ/JLPT/作業メモ/開発メモ/勉強メモ/日本語メモ/英語メモ/エンジニア知識/単語/Linux/Mac/Win/Eclipse/Maven/IDEA/クイックチェック/work/外国人/ツール/TODO Waterfall-model 要件定義/基本設計/詳細設計/実装/テスト/リリース マークダウン Markdown 基礎 名称 描述 语法 示例 markdown-it-abbr 注释 *[HTML]: 超文本标记语言 *[HTML]: 超文本标记语言 markdown-it-emoji 表情 :) 😃 markdown-it-footnote 脚注 参考文献[^1] 参考文献[^1] markdown-it-ins 下划线 ++下划线++ 下划线 markdown-it-mark 突出显示 ==标记== 标记 markdown-it-sub 下标 H~2~O H2O markdown-it-sup 上标 X^2^ X2 markdown-it-checkbox 复选框 未选：- [ ]选中：- [x] 未选 选中 ハイレベル markdown-it-imsize：自定义图片宽高。 ![test](https://raw.githubusercontent.com/ooblivion/PicGo-repository/master/Others/202404042208048.jpg =100x200) 出力 实际上好像并无法自定义宽高，只会以值更小的那一边为准。 markdown-it-expandable：折叠/展开内容。 &nbsp;クリックで折りたたむこれが隠されている内容です。 12345678910111213141516171819+++ **クリックで折りたたむ** これが隠されている内容です。 +++## Closed++++ Click me!Hidden text+++ NestedInner hidden text+++++++## Open+++&gt; Click me!Hidden text+++ NestedInner hidden text++++++&gt; markdown-it-container：自定义容器。 12345678910111213141516171819::: tips**提示**这是一个提示:::::: warning**注意**这是一个警告:::::: danger**警告**这是一个危险信号:::::: success**成功**这是一个成功信号::: 提示 这是一个提示 注意 这是一个警告 警告 这是一个危险信号 成功 这是一个成功信号 title code","link":"/hexo-create-blog/"},{"title":"SQL最適化のヒント","text":"– JP – – CN – SQL优化方面的一些技巧和方法 SQLの最適化に関するいくつかのヒントとトリック。 介绍 SQL 优化在提升系统性能中是：成本最低和优化效果最明显的途径。 如果你的团队在 SQL 优化这方面做得很优秀，对你们整个大型系统可用性方面无疑是一个质的跨越。 优化成本：硬件&gt;系统配置&gt;数据库表结构&gt;SQL 及索引。 优化效果：硬件&lt;系统配置&lt;数据库表结构 SQL优化原则 首先，对于MySQL层优化我一般遵从五个原则： 减少数据访问：设置合理的字段类型，启用压缩，通过索引访问等减少磁盘 IO。返回更少的数据：只返回需要的字段和数据分页处理，减少磁盘 IO 及网络 IO。减少交互次数：批量 DML 操作，函数存储等减少数据连接次数。减少服务器 CPU 开销：尽量减少数据库排序操作以及全表查询，减少 CPU 内存占用。利用更多资源：使用表分区，可以增加并行操作，更大限度利用 CPU 资源。总结到 SQL 优化中，就如下三点： 最大化利用索引。尽可能避免全表扫描。减少无效数据的查询。理解 SQL 优化原理 ，首先要搞清楚 SQL 执行顺序。 SELECT 语句，语法顺序如下： SELECT DISTINCT &lt;select_list&gt; FROM &lt;left_table&gt; &lt;join_type&gt; JOIN &lt;right_table&gt; ON &lt;join_condition&gt; WHERE &lt;where_condition&gt; GROUP BY &lt;group_by_list&gt; HAVING &lt;having_condition&gt; ORDER BY &lt;order_by_condition&gt; 10.LIMIT &lt;limit_number&gt; SELECT 语句，执行顺序如下： 12345678910111213141516171819202122FROM &lt;表名&gt; # 选取表，将多个表数据通过笛卡尔积变成一个表。 ON &lt;筛选条件&gt; # 对笛卡尔积的虚表进行筛选 JOIN &lt;join, left join, right join...&gt; &lt;join表&gt; # 指定join，用于添加数据到on之后的虚表中，例如left join会将左表的剩余数据添加到虚表中 WHERE &lt;where条件&gt; # 对上述虚表进行筛选 GROUP BY &lt;分组条件&gt; # 分组 &lt;SUM()等聚合函数&gt; # 用于having子句进行判断，在书写上这类聚合函数是写在having判断里面的 HAVING &lt;分组筛选&gt; # 对分组后的结果进行聚合筛选 SELECT &lt;返回数据列表&gt; # 返回的单列必须在group by子句中，聚合函数除外 DISTINCT # 数据除重 ORDER BY &lt;排序条件&gt; # 排序 LIMIT &lt;行数限制&gt; 以下 SQL 优化策略适用于数据量较大的场景下，如果数据量较小，没必要以此为准，以免画蛇添足。 避免不走索引的场景 ①尽量避免在字段开头模糊查询，会导致数据库引擎放弃索引进行全表扫描 如下： SELECT * FROM t WHERE username LIKE ‘%陈%’ 优化方式：尽量在字段后面使用模糊查询。 如下： SELECT * FROM t WHERE username LIKE ‘陈%’ 如果需求是要在前面使用模糊查询： 使用 MySQL 内置函数 INSTR(str，substr)来匹配，作用类似于 Java 中的 indexOf()，查询字符串出现的角标位置。使用 FullText 全文索引，用 match against 检索。数据量较大的情况，建议引用 ElasticSearch、Solr，亿级数据量检索速度秒级。当表数据量较少(几千条儿那种)，别整花里胡哨的，直接用 like ‘%xx%’。 ②尽量避免使用 in 和 not in，会导致引擎走全表扫描 如下： SELECT * FROM t WHERE id IN (2,3) 优化方式：如果是连续数值，可以用 between 代替。 如下： SELECT * FROM t WHERE id BETWEEN 2 AND 3 如果是子查询，可以用 exists 代替。 如下： – 不走索引 select * from A where A.id in (select id from B); – 走索引 select * from A where exists (select * from B where B.id = A.id); ③尽量避免使用 or，会导致数据库引擎放弃索引进行全表扫描 如下： SELECT * FROM t WHERE id = 1 OR id = 3 优化方式：可以用 union 代替 or。 如下： SELECT * FROM t WHERE id = 1 UNION SELECT * FROM t WHERE id = 3 ④尽量避免进行 null 值的判断，会导致数据库引擎放弃索引进行全表扫描 如下： SELECT * FROM t WHERE score IS NULL 优化方式：可以给字段添加默认值 0，对 0 值进行判断。 如下： SELECT * FROM t WHERE score = 0 ⑤尽量避免在 where 条件中等号的左侧进行表达式、函数操作，会导致数据库引擎放弃索引进行全表扫描 可以将表达式、函数操作移动到等号右侧，如下： – 全表扫描 SELECT * FROM T WHERE score/10 = 9 – 走索引 SELECT * FROM T WHERE score = 10*9 ⑥当数据量大时，避免使用 where 1=1 的条件 通常为了方便拼装查询条件，我们会默认使用该条件，数据库引擎会放弃索引进行全表扫描。 如下： SELECT username, age, sex FROM T WHERE 1=1 优化方式：用代码拼装 SQL 时进行判断，没 where 条件就去掉 where，有 where 条件就加 and。 ⑦查询条件不能用 &lt;&gt; 或者 != 使用索引列作为条件进行查询时，需要避免使用&lt;&gt;或者!=等判断条件。 如确实业务需要，使用到不等于符号，需要在重新评估索引建立，避免在此字段上建立索引，改由查询条件中其他索引字段代替。 ⑧where 条件仅包含复合索引非前置列 如下：复合(联合)索引包含 key_part1，key_part2，key_part3 三列，但 SQL 语句没有包含索引前置列&quot;key_part1&quot;，按照 MySQL 联合索引的最左匹配原则，不会走联合索引。 select col1 from table where key_part2=1 and key_part3=2 ⑨隐式类型转换造成不使用索引 如下 SQL 语句由于索引对列类型为 varchar，但给定的值为数值，涉及隐式类型转换，造成不能正确走索引。 select col1 from table where col_varchar=123; ⑩order by 条件要与 where 中条件一致，否则 order by 不会利用索引进行排序 如下： – 不走age索引 SELECT * FROM t order by age; – 走age索引 SELECT * FROM t where age &gt; 0 order by age; 对于上面的语句，数据库的处理顺序是： 第一步：根据 where 条件和统计信息生成执行计划，得到数据。第二步：将得到的数据排序。当执行处理数据(order by)时，数据库会先查看第一步的执行计划，看 order by 的字段是否在执行计划中利用了索引。如果是，则可以利用索引顺序而直接取得已经排好序的数据。如果不是，则重新进行排序操作。第三步：返回排序后的数据。当 order by 中的字段出现在 where 条件中时，才会利用索引而不再二次排序，更准确的说，order by 中的字段在执行计划中利用了索引时，不用排序操作。 这个结论不仅对 order by 有效，对其他需要排序的操作也有效。比如 group by 、union 、distinct 等。 ⑪正确使用 hint 优化语句 MySQL 中可以使用 hint 指定优化器在执行时选择或忽略特定的索引。 一般而言，处于版本变更带来的表结构索引变化，更建议避免使用 hint，而是通过 Analyze table 多收集统计信息。 但在特定场合下，指定 hint 可以排除其他索引干扰而指定更优的执行计划： USE INDEX 在你查询语句中表名的后面，添加 USE INDEX 来提供希望 MySQL 去参考的索引列表，就可以让 MySQL 不再考虑其他可用的索引。例子: SELECT col1 FROM table USE INDEX (mod_time, name)… IGNORE INDEX 如果只是单纯的想让 MySQL 忽略一个或者多个索引，可以使用 IGNORE INDEX 作为 Hint。例子: SELECT col1 FROM table IGNORE INDEX (priority) … FORCE INDEX 为强制 MySQL 使用一个特定的索引，可在查询中使用FORCE INDEX 作为 Hint。例子: SELECT col1 FROM table FORCE INDEX (mod_time) … 在查询的时候，数据库系统会自动分析查询语句，并选择一个最合适的索引。但是很多时候，数据库系统的查询优化器并不一定总是能使用最优索引。 如果我们知道如何选择索引，可以使用 FORCE INDEX 强制查询使用指定的索引。 例如： SELECT * FROM students FORCE INDEX (idx_class_id) WHERE class_id = 1 ORDER BY id DESC; SELECT 语句其他优化 ①避免出现 select * 首先，select * 操作在任何类型数据库中都不是一个好的 SQL 编写习惯。 使用 select * 取出全部列，会让优化器无法完成索引覆盖扫描这类优化，会影响优化器对执行计划的选择，也会增加网络带宽消耗，更会带来额外的 I/O，内存和 CPU 消耗。 建议提出业务实际需要的列数，将指定列名以取代 select *。具体详情见《为什么大家都说SELECT * 效率低》 ②避免出现不确定结果的函数 特定针对主从复制这类业务场景。由于原理上从库复制的是主库执行的语句，使用如 now()、rand()、sysdate()、current_user() 等不确定结果的函数很容易导致主库与从库相应的数据不一致。 另外不确定值的函数，产生的 SQL 语句无法利用 query cache。 ③多表关联查询时，小表在前，大表在后 在 MySQL 中，执行 from 后的表关联查询是从左往右执行的(Oracle 相反)，第一张表会涉及到全表扫描。 所以将小表放在前面，先扫小表，扫描快效率较高，在扫描后面的大表，或许只扫描大表的前 100 行就符合返回条件并 return 了。 例如：表 1 有 50 条数据，表 2 有 30 亿条数据;如果全表扫描表 2，你品，那就先去吃个饭再说吧是吧。 ④使用表的别名 当在 SQL 语句中连接多个表时，请使用表的别名并把别名前缀于每个列名上。这样就可以减少解析的时间并减少哪些友列名歧义引起的语法错误。 ⑤用 where 字句替换 HAVING 字句 避免使用 HAVING 字句，因为 HAVING 只会在检索出所有记录之后才对结果集进行过滤，而 where 则是在聚合前刷选记录，如果能通过 where 字句限制记录的数目，那就能减少这方面的开销。 HAVING 中的条件一般用于聚合函数的过滤，除此之外，应该将条件写在 where 字句中。 where 和 having 的区别：where 后面不能使用组函数。 ⑥调整 Where 字句中的连接顺序 MySQL 采用从左往右，自上而下的顺序解析 where 子句。根据这个原理，应将过滤数据多的条件往前放，最快速度缩小结果集。 增删改 DML 语句优化 ①大批量插入数据 如果同时执行大量的插入，建议使用多个值的 INSERT 语句(方法二)。这比使用分开 INSERT 语句快(方法一)，一般情况下批量插入效率有几倍的差别。 方法一： insert into T values(1,2); insert into T values(1,3); insert into T values(1,4); 方法二： Insert into T values(1,2),(1,3),(1,4); 选择后一种方法的原因有三： 减少 SQL 语句解析的操作，MySQL 没有类似 Oracle 的 share pool，采用方法二，只需要解析一次就能进行数据的插入操作。在特定场景可以减少对 DB 连接次数。 SQL 语句较短，可以减少网络传输的 IO。 ②适当使用 commit 适当使用 commit 可以释放事务占用的资源而减少消耗，commit 后能释放的资源如下： 事务占用的 undo 数据块。事务在 redo log 中记录的数据块。释放事务施加的，减少锁争用影响性能。特别是在需要使用 delete 删除大量数据的时候，必须分解删除量并定期 commit。 ③避免重复查询更新的数据 针对业务中经常出现的更新行同时又希望获得改行信息的需求，MySQL 并不支持 PostgreSQL 那样的 UPDATE RETURNING 语法，在 MySQL 中可以通过变量实现。 例如，更新一行记录的时间戳，同时希望查询当前记录中存放的时间戳是什么? 简单方法实现： Update t1 set time=now() where col1=1; Select time from t1 where id =1; 使用变量，可以重写为以下方式： Update t1 set time=now () where col1=1 and @now: = now (); Select @now; 前后二者都需要两次网络来回，但使用变量避免了再次访问数据表，特别是当 t1 表数据量较大时，后者比前者快很多。 ④查询优先还是更新(insert、update、delete)优先 MySQL 还允许改变语句调度的优先级，它可以使来自多个客户端的查询更好地协作，这样单个客户端就不会由于锁定而等待很长时间。改变优先级还可以确保特定类型的查询被处理得更快。 我们首先应该确定应用的类型，判断应用是以查询为主还是以更新为主的，是确保查询效率还是确保更新的效率，决定是查询优先还是更新优先。 下面我们提到的改变调度策略的方法主要是针对只存在表锁的存储引擎，比如 MyISAM 、MEMROY、MERGE，对于 Innodb 存储引擎，语句的执行是由获得行锁的顺序决定的。 MySQL 的默认的调度策略可用总结如下： 写入操作优先于读取操作。对某张数据表的写入操作某一时刻只能发生一次，写入请求按照它们到达的次序来处理。对某张数据表的多个读取操作可以同时地进行。 MySQL 提供了几个语句调节符，允许你修改它的调度策略： LOW_PRIORITY 关键字应用于 DELETE、INSERT、LOAD DATA、REPLACE 和 UPDATE。 HIGH_PRIORITY 关键字应用于 SELECT 和 INSERT 语句。 DELAYED 关键字应用于 INSERT 和 REPLACE 语句。如果写入操作是一个 LOW_PRIORITY(低优先级)请求，那么系统就不会认为它的优先级高于读取操作。 在这种情况下，如果写入者在等待的时候，第二个读取者到达了，那么就允许第二个读取者插到写入者之前。 只有在没有其它的读取者的时候，才允许写入者开始操作。这种调度修改可能存在 LOW_PRIORITY 写入操作永远被阻塞的情况。 SELECT 查询的 HIGH_PRIORITY(高优先级)关键字也类似。它允许 SELECT 插入正在等待的写入操作之前，即使在正常情况下写入操作的优先级更高。 另外一种影响是，高优先级的 SELECT 在正常的 SELECT 语句之前执行，因为这些语句会被写入操作阻塞。 如果希望所有支持 LOW_PRIORITY 选项的语句都默认地按照低优先级来处理，那么请使用–low-priority-updates 选项来启动服务器。 通过使用 INSERTHIGH_PRIORITY 来把 INSERT 语句提高到正常的写入优先级，可以消除该选项对单个 INSERT 语句的影响。 查询条件优化 ①对于复杂的查询，可以使用中间临时表暂存数据 ②优化 group by 语句 默认情况下，MySQL 会对 GROUP BY 分组的所有值进行排序，如 “GROUP BY col1，col2，…;” 查询的方法如同在查询中指定 “ORDER BY col1，col2，…;” 。 如果显式包括一个包含相同的列的 ORDER BY 子句，MySQL 可以毫不减速地对它进行优化，尽管仍然进行排序。 因此，如果查询包括 GROUP BY 但你并不想对分组的值进行排序，你可以指定 ORDER BY NULL 禁止排序。 例如： SELECT col1, col2, COUNT(*) FROM table GROUP BY col1, col2 ORDER BY NULL ; ③优化 join 语句 MySQL 中可以通过子查询来使用 SELECT 语句来创建一个单列的查询结果，然后把这个结果作为过滤条件用在另一个查询中。 使用子查询可以一次性的完成很多逻辑上需要多个步骤才能完成的 SQL 操作，同时也可以避免事务或者表锁死，并且写起来也很容易。但是，有些情况下，子查询可以被更有效率的连接(JOIN)…替代。 例子：假设要将所有没有订单记录的用户取出来，可以用下面这个查询完成： ELECT col1 FROM customerinfo WHERE CustomerID NOT in (SELECT CustomerID FROM salesinfo ) 如果使用连接(JOIN)…来完成这个查询工作，速度将会有所提升。 尤其是当 salesinfo 表中对 CustomerID 建有索引的话，性能将会更好，查询如下： SELECT col1 FROM customerinfo LEFT JOIN salesinfoON customerinfo.CustomerID=salesinfo.CustomerID WHERE salesinfo.CustomerID IS NULL 连接(JOIN)…之所以更有效率一些，是因为 MySQL 不需要在内存中创建临时表来完成这个逻辑上的需要两个步骤的查询工作。 ④优化 union 查询 MySQL 通过创建并填充临时表的方式来执行 union 查询。除非确实要消除重复的行，否则建议使用 union all。 原因在于如果没有 all 这个关键词，MySQL 会给临时表加上 distinct 选项，这会导致对整个临时表的数据做唯一性校验，这样做的消耗相当高。 高效： SELECT COL1, COL2, COL3 FROM TABLE WHERE COL1 = 10 UNION ALL SELECT COL1, COL2, COL3 FROM TABLE WHERE COL3= ‘TEST’; 低效： SELECT COL1, COL2, COL3 FROM TABLE WHERE COL1 = 10 UNION SELECT COL1, COL2, COL3 FROM TABLE WHERE COL3= ‘TEST’; ⑤拆分复杂 SQL 为多个小 SQL，避免大事务 如下： 简单的 SQL 容易使用到 MySQL 的 QUERY CACHE。减少锁表时间特别是使用 MyISAM 存储引擎的表。可以使用多核 CPU。 ⑥使用 truncate 代替 delete 当删除全表中记录时，使用 delete 语句的操作会被记录到 undo 块中，删除记录也记录 binlog。 当确认需要删除全表时，会产生很大量的 binlog 并占用大量的 undo 数据块，此时既没有很好的效率也占用了大量的资源。 使用 truncate 替代，不会记录可恢复的信息，数据不能被恢复。也因此使用 truncate 操作有其极少的资源占用与极快的时间。另外，使用 truncate 可以回收表的水位，使自增字段值归零。 ⑦使用合理的分页方式以提高分页效率 使用合理的分页方式以提高分页效率 针对展现等分页需求，合适的分页方式能够提高分页的效率。 案例 1： select * from t where thread_id = 10000 and deleted = 0 order by gmt_create asc limit 0, 15; 上述例子通过一次性根据过滤条件取出所有字段进行排序返回。数据访问开销=索引 IO+索引全部记录结果对应的表数据 IO。 因此，该种写法越翻到后面执行效率越差，时间越长，尤其表数据量很大的时候。 适用场景：当中间结果集很小(10000 行以下)或者查询条件复杂(指涉及多个不同查询字段或者多表连接)时适用。 案例 2： select t.* from (select id from t where thread_id = 10000 and deleted = 0 order by gmt_create asc limit 0, 15) a, t where a.id = t.id; 上述例子必须满足 t 表主键是 id 列，且有覆盖索引 secondary key：(thread_id, deleted, gmt_create)。 通过先根据过滤条件利用覆盖索引取出主键 id 进行排序，再进行 join 操作取出其他字段。 数据访问开销=索引 IO+索引分页后结果(例子中是 15 行)对应的表数据 IO。因此，该写法每次翻页消耗的资源和时间都基本相同，就像翻第一页一样。 适用场景：当查询和排序字段(即 where 子句和 order by 子句涉及的字段)有对应覆盖索引时，且中间结果集很大的情况时适用。 建表优化 ①在表中建立索引，优先考虑 where、order by 使用到的字段。 ②尽量使用数字型字段(如性别，男：1 女：2)，若只含数值信息的字段尽量不要设计为字符型，这会降低查询和连接的性能，并会增加存储开销。 这是因为引擎在处理查询和连接时会 逐个比较字符串中每一个字符，而对于数字型而言只需要比较一次就够了。 ③查询数据量大的表 会造成查询缓慢。主要的原因是扫描行数过多。这个时候可以通过程序，分段分页进行查询，循环遍历，将结果合并处理进行展示。 要查询 100000 到 100050 的数据，如下： SELECT * FROM (SELECT ROW_NUMBER() OVER(ORDER BY ID ASC) AS rowid,* FROM infoTab)t WHERE t.rowid &gt; 100000 AND t.rowid &lt;= 100050 ④用 varchar/nvarchar 代替 char/nchar。 尽可能的使用 varchar/nvarchar 代替 char/nchar ，因为首先变长字段存储空间小，可以节省存储空间，其次对于查询来说，在一个相对较小的字段内搜索效率显然要高些。 不要以为 NULL 不需要空间，比如：char(100) 型，在字段建立时，空间就固定了， 不管是否插入值(NULL 也包含在内)，都是占用 100 个字符的空间的，如果是 varchar 这样的变长字段， null 不占用空间。","link":"/sql-optimization-tips/"},{"title":"Springでクロスドメインアクセスを実現する方法","text":"Spring でのクロスドメイン アクセスの問題を解決するには、さまざまな方法があります。以下に、いくつかの一般的な解決策と対応するコード例を示します。 @CrossOrigin アノテーションを使用します Spring MVC コントローラー メソッドに @CrossOrigin アノテーションを追加すると、特定のオリジンがドメインを越えてメソッドにアクセスできるようになります。 12345678910111213import org.springframework.web.bind.annotation.CrossOrigin;import org.springframework.web.bind.annotation.GetMapping;import org.springframework.web.bind.annotation.RestController;@RestControllerpublic class MyController { @CrossOrigin(origins = &quot;http://example.com&quot;) @GetMapping(&quot;/data&quot;) public String getData() { return &quot;Some data&quot;; }} WebMvcConfigurer を使用して構成します Spring Boot では、WebMvcConfigurer インターフェイスを実装することで、クロスドメイン アクセスをグローバルに構成できます。 1234567891011121314151617import org.springframework.context.annotation.Configuration;import org.springframework.web.servlet.config.annotation.CorsRegistry;import org.springframework.web.servlet.config.annotation.WebMvcConfigurer;@Configurationpublic class CorsConfig implements WebMvcConfigurer { @Override public void addCorsMappings(CorsRegistry registry) { registry.addMapping(&quot;/api/**&quot;) .allowedOrigins(&quot;http://example.com&quot;) .allowedMethods(&quot;GET&quot;, &quot;POST&quot;) .allowedHeaders(&quot;header1&quot;, &quot;header2&quot;) .allowCredentials(true) .maxAge(3600); }} フィルターフィルターを使用します Filter フィルターを作成し、その中にクロスドメイン関連の応答ヘッダー情報を構成します。 12345678910111213141516171819202122import javax.servlet.*;import javax.servlet.http.HttpServletRequest;import javax.servlet.http.HttpServletResponse;import java.io.IOException;public class CorsFilter implements Filter { @Override public void doFilter(ServletRequest request, ServletResponse response, FilterChain chain) throws IOException, ServletException { HttpServletResponse httpResponse = (HttpServletResponse) response; HttpServletRequest httpRequest = (HttpServletRequest) request; httpResponse.setHeader(&quot;Access-Control-Allow-Origin&quot;, &quot;http://example.com&quot;); httpResponse.setHeader(&quot;Access-Control-Allow-Methods&quot;, &quot;GET,POST&quot;); httpResponse.setHeader(&quot;Access-Control-Allow-Headers&quot;, &quot;header1,header2&quot;); httpResponse.setHeader(&quot;Access-Control-Allow-Credentials&quot;, &quot;true&quot;); httpResponse.setHeader(&quot;Access-Control-Max-Age&quot;, &quot;3600&quot;); chain.doFilter(request, response); }} 上記は、Spring でクロスドメイン アクセスの問題を解決するための一般的な方法をいくつか示していますが、どの方法を選択するかは、プロジェクトのニーズと設計によって異なります。","link":"/spring-cross-domain-achive/"},{"title":"基本設計記事","text":"基本設計について 記事 基本設計 とは ■基本設計 要件定義のフェーズで作成された要件定義書をもとにして、システムの骨組みを設計する工程です。完成した基本設計書で実装が進められていくため、要件を満たしているか、また、システムがどのようなものであるかを考慮して設計していきます。 基本設計の工程では、以下の成果物を作成していきます。・画面遷移図・画面設計書・DB設計書・API設計書 ■DB とは DataBaseの略。データの基地(data + base)を意味します。 データを保管する貯蔵庫の役割を果たすもので、アプリケーションを利用するうえで必要となるデータの集まりを指します。 ■API とは 「Application Programming Interface」の略。それぞれの単語の意味は以下の通りです。・Application(アプリケーション)：パソコンやスマホの中で動くソフト・Programming(プログラミング)：パソコンやスマホに実行させる指示を出す・Interface(インターフェース) ：接続部分や接触する箇所 それぞれの単語を組み合わせると、「アプリケーションとプログラムをつなぐもの」という意味になります。つまりAPIとは、いくつかのアプリケーションやソフトウェア同士が情報をやり取りする際に使用されるプログラミング上の窓口と理解しておくとよいでしょう。 ■APIの動作イメージ API利用者が、事前に定められた形式に従って使いたい機能や情報をまとめてリクエスト（要求）します。それに対し、API側はリクエストを受け取ると、送信された条件を処理してレスポンス（応答）を返します。 リクエストの定められた形式については、APIサービスの提供者側が必要な情報をまとめて定義し、利用者に提示します。 面遷移図 画面設計書 API設計書 DB設計書","link":"/base-design/"},{"title":"開発によく使われるツールやwebサイト","text":"開発ツール VisualCode VisualStudio 2022 2017 2012 IDEA Eclipse &amp; Eclipse Spring Tool Suite（STS） その他のツール コード比較：WinMerge テキストエディタ：Sakura Typora DBツール：A5M2 Navicat MySQLWorkbench ログ解析ツール：ELK Sentry APIツール：Swagger Postman サーバ：Apache Tomcat コンテナツール：Dcoker WEBデザインツール：figma 図作り：drawio（AWSフローチャート） 印鑑： コミュニケーション Ipmsg Slack Teams プロジェクト管理ツール Redmine Backlog Notion Jira コード管理ツール GIT：github gitlab SVN：TortoiseSVN TFS：VisualStudio組み込み ウェブサイト 図作り https://app.diagrams.net/ ランダム生成時間 https://www.lddgo.net/string/random-date 正規表見 https://regex101.com/ ひらがなカタカナ http://www.hipenpal.com/tool/japanese-hiragana-to-katakana-converter-in-simplified-chinese.php エクセルからhtmlへ https://tableconvert.com/zh-cn/excel-to-html markdwon編集する Hexo博客的Markdown语法 codesheet 工具汇总网站 https://github.com/rd2coding/Road2Coding?tab=readme-ov-file 菜鸟工具 https://www.jyshare.com/","link":"/development-usually-use-websites-and-tool/"},{"title":"自分でやりたいプロジェクト","text":"写一个全平台音乐播放器项目 用ReactNative写一个麻将项目，还有各种卡牌桌游游戏规则可以分享导出 雀魂----从入门到入土（内附日本麻将基础教程） 美食美景记录 地图 使用手册记录app 各种家电说明书，以及游戏规则，组装，可以文字录入，也可拍照，AR识别 学会用wordpress写广告网站 写一个全平台的饭店软件（预约，菜单）可以变成saas 写一个上班可以摸鱼的网页，这个网页可以暂时存储代码，可以上班的时候写自己外包项目的代码 写一个个人的博客，并且可以在其他电脑上登陆和更新博客内容，并新建博客 TODO 做一个自己的音乐播放器，因为我喜欢听歌，要省电，全平台，云同步，方便好用。匹配最新的安卓和苹果，支持热更新 练手，从前后端弄一个ECサート 重新整理一下的我博客，记录开发中遇到的各种问题。 midworks 类似的项目(自由职业者接项目的网站) 并且用rn写一写移动端，从api设计，到部署上线，以及后续的更新 并且支持多语言 技术栈 java spring react vue rn 如何部署到云 如何省钱 是否支持个人展示界面 有哪些值得学习的大型 React 开源项目？推荐10个React开源项目使用 springboot 和 react 开发的博客系统","link":"/todo-project/"},{"title":"仕事用日本語ノート","text":"本記事について はじめに 社内用語 申し出る表現と応答表現 (提供表达和响应表达) 何かお手伝いしましょうか? ありがとう、大丈夫です コビーをお取りしましょうか? ありがとう、だけどできますよ 私に何かできることがありますか? ありがとう、お願いします(ご親切謝します) 何かご用の場合は、遠慮なくお申し付けください ご親切ありがとう アドバイスを求める表現 (寻求建议的表达) お忙しいところすみませんが、少し質問がございます この件に関してどのように対処すべきか、ご存しですか? プレゼンの方法についてアドバイスが欲しいのですが. 予算の問題について何かアドバイスをいただければと思うのですが. 苦情を処理する方法についてアドバイスをいただけませんか? 良いアイデアが何か浮かんだら教えてください。 提案&amp;アドバイスの表現 (意见和建议的) 仕事に優先順位をつけることが大切です チェンさんと宜接お会いになることを提案します この帯ですと、タクシーよりも電車を使う方がよいでしょう 昨年の予算を見直すことを提案します 結論を箇条書きにした方がよいと思います 机のまわりを整理整頓した方がよいと思います それに関して謝罪した方がよいと思いますよ それに関しては議諭しない方がよいですよ Eメールの口調を変えたほうがよいでしょう それに不要になった秘書類はシュレッダーにかけてください 確認方法 1つ確認したいことがあります。通常の項目だけでなく、ボタンも○○の色に変更してもよろしいでしょうか？ この ○○ファイルはほぼ完成しましたが、まだいくつか不確実な点があります。それでも、次のステップに進んでいます。 不確定な部分には、オレンジ色を付けました。 雑談 おはようございます！仕事はどうですか？順調ですか？ この仕事は私の能力の許す範囲内で可能な限り最善を尽くしました。 私はこの仕事において、自分の能力の範囲内で最善を尽くしました。 I have done my best within the limits of my abilities on this job. IT単語 ITgo技术者之家 単語 【释义】 【例句】 ガバガバ（がばがば） 完全没有做必要的安全对策。 開発環境とはいえガバガバなのはどうかと思う。 虽然是开发环境，漏洞百出也不行吧。 お尻（おしり） 指期限的意思，有的时候也说成「ケツ」。 お尻ってずらせないの？ 完成期限能放宽一下吗？ ちくちく 和“しこしこ”类似，指一点点地做某事。 ちくちくログを追っかけてる。 正在一点点地分析日志。 ヌルヌル 页面切换的时候动作或过程顺畅，反义词是“カクカク”。 思った以上にヌルヌル動くね。 比想象中跑得要顺畅。 しこしこ 一点点实现想做的事，主要指利用空闲时间。 面倒だけどしこしこ作りました。 虽然很麻烦但是还是一点点地做出来了。 ゴリゴリ（ごりごり） 强行使用复杂的技巧实现一些机能。 昔の偉い人がゴリゴリ書いたSQLが読めない。 以前的大拿故弄玄虚写的那些SQL根本看不懂。 引く（ひく） 原意比较多。软件开发中多是指域名解析，有正向查找和反向查找，和查字典（辞書を引く）有点接近。 「サーバにつながらないです。」 「確認だけど、名前は引ける ？」 “服务器连不上了。” “确认一下，域名能查到吗？” サチる（さちる） 字典里一般没有这个词，是从单词saturate(饱和)衍生过来，用于形容资源的使用量比较高、剩余不多的情况。 ネットワークがサチってる。 网络很慢。 倒れる（たおれる） 原意有倒塌的意思，在ACT-STANDBY构成的系统中，ACT发生故障时启动备用系统（STANDBY）以确保系统的可用性和连续性。这过程通常称为“Failover”（故障切换）。 主系が落ちて副系に倒れて動いてるみたい。 主系统瘫痪了，切换到备用系统好像能跑通了。 踏む（ふむ） 愿意是踩、踏的意思，开发现场有时指遇到了不好的事情。和踩地雷有点类似。 「原因わかった？」 「バグ踏みました。」 “原因明白了吗？” “是bug。” 垂らす（たらす） 原意为垂下的意思，和“這わす”相反是指把配线从顶棚走。 「ここの配線ってどうするの？」 「天井から垂らします。」 “怎么布线？” “从天花板走。” 張り付く（はりつく） 原意为贴附，软件开发中经常指CPU或内存的使用率一直比较高的状态。 CPUがずっと100%に張り付いている。 CPU使用率一直都在100%。 掴む（つかむ） 原意是抓住、掌握的意思，软件开发中会用在进程等资源正在使用无法释放的情况。 原ファイルが掴まれててアンマウントできない。 原文件正在使用没法解除挂载。 流す（ながす） 原意是放、流的意思，软件开发中指执行处理，尤其是指启动批处理。 データ変更バッチを流す。 执行数据更新的批处理。 殺す（ころす） 【释义1】 指强制停止无法控制的进程。 【例句】 とりあえずプロセスを殺してみよう。 先杀一下进程试试看吧。 【释义2】 将系统或者程序的部分功能无效化的意思。 【例句】 圧縮は圧縮で負荷がかかるから殺しておこう。 压缩会增加负担，把这个功能关闭了吧。 カツカツ（かつかつ） 资源已经完全被占用。 今月はもうずっとカツカツ 。 这个月一直非常非常忙。 ガチガチ（がちがち） 原意是变硬、一丝不苟的意思。软件开发中是指严密、滴水不漏。 ガチガチにしたいのは分かるけどあんまりだ。 想做得滴水不漏可以理解，但是有点太过了吧。 ぐるぐる 原意是“转、卷”的意思，软件开发中特指进程一直转动而毫无进展。 ずっとぐるぐるしてるんだけど…。 虽然图标一直在转… くるくる 重复做某事的意思。 リクエストのたびに処理がくるくる動く。 每次一来请求处理就会反复运行。 倒す（たおす） 原意是扳、打倒的意思，有时指方针倾向。 この件は安全な方に倒したい。 这件事我们还是倾向于选择安全的方案。 渡す（わたす） 原意为转递的意思。软件开发中经常指数据传递，比如参数的传递。 パラメータを渡してプロセスを起動する。 传递参数启动进程。 立てる（たてる） 原意比较多。软件开发中经常指构建服务器。 あいつは家にDNSを立ててる変態だ。 那家伙是个能在家里搭DNS服务器的技术狂。 食べる（たべる） 原意是吃饭的意思。软件开发中有时指导入数据。 ログを監査のために食べさせている。 因为要监视日志，正在导入数据。 食う（くう） 原意是吃饭的意思。 软件开发中指系统或程序对资源的占有。 ちょっとこれメモリ食い過ぎでしょ。 内存吃得有点多啊。 吐く（はく） 原意是吐的意思。 软件开发中指数据生成。 吐かれたログを確認する。 确认一下生成的日志。 舐める（なめる） 原意有舔的意思。 软件开发中经常指走查数据。 そのバッチでは日次でテーブルを舐める 。 那个批处理每天都会把表格的数据走查一遍。 言う（いう） 原意是说的意思。 软件开发中有时指输出信息或者日志。 なんて言って落ちてるの？ 日志里出的什么内容？为啥跑不起来了。 喋る（しゃべる） 原意是说话的意思。 软件开发中，有时指根据协议进行数据的发送接收。 最近のBIOSというかUEFIはIPを喋れるので、直接アップデートがダウンロードできる。 最近的BIOS，或者说UEFI，已经能够发送IP通信，因此可以直接下载更新。 ネゴる（ねごる） 字典里应该是没有这个词，从negotiate（交涉）来的造词，和“握る”一样，事先和其他人商量某事。 先にネゴってきて。 刚才商量好了。 ゴネる（ごねる） 愿意是不满、牢骚等意思，有时指交涉失败妥协的意思。 お金でゴネてサポートを延長してもらった。 技术支持延长用钱摆平了。 ガリガリ（がりがり） 虽然处理比较简单，但是需要写大量代码。 ガリガリ書けばいいだけの話なんだけど、なんだかやる気がでない。 虽然都是些简单的处理只要做就可以，但就是不想做。 カリカリ（かりかり） （主要是性能方面）经过反复打磨的意思。 カリカリにチューニングされたWebシステム。 经过不断打磨调整优化过的WEB系统。 温度感（おんどかん） 对方的态度。 障害らしいけど、温度感どうなの？ 好像是bug，对方怎么说？ そもそも論（そもそもろん） 主要用于讨论的时候，讨论内容本身有可能就是有问题的。 そもそも論として、どうしてこの話してるんだっけ？誰が得するの？ 回到原点，我们为什么在讨论这个话题？对谁有好处？ 壁打ち（かべうち） 原义指对着墙壁练习打球，工作场景中多指用找人倾听的方式整理思路。 叩き台作るまでの壁打ちに付き合ってもらっていいですか？ 能陪我一直把草案做好吗？ プッシュ（ぷっしゅ） 督促。需要对方做的工作一直没有动静，推一下。 あれって忘れられてない？佐藤さんにプッシュしといて。 那个事不是忘了吧？去催一下佐藤。 言った言わない（いったいわない） 对立双方的主张没有记录，不知道谁对谁错。 このまま話したところで言った言わないにしかならないのでもうやめましょう。 这样说下去，也就只有说过没说过，所以不要争论了。 正直ベース（しょうじきべーす） 发现对方比较难于启齿的时候，告诉对方按实际情况说就行。 正直ベースでいいんだけど、間に合いそう？ 实事求是就行，来得及吗？ 運用でカバー（うんようでかばー） 系统难以解决的问题，通过改变运营方式回避问题，系统开发上叫“运用回避”。 開発が間に合わなかったから，当面は運用でカバーして！ 现在开发已经来不及了，暂时用运用来回避一下这个问题！ ネック（ねっく） 瓶颈的意思，是“ボトルネック”的缩略语。主要用在性能或者工作进行过程中的问题点。 結局、何がネックなの？ 到底瓶颈在哪里？ 刺さる（ささる） 产品或提案内容非常符合客户的需求。 そんなの持って行って刺さるの？ 拿着这种东西去提案有啥用吗？ はまる 【释义1】 非常合适的意思。 【例句】 RDBよりもKVSが今回はよくはまる 。 和RDB比较的话，这次选用KVS更合适。 【释义2】 非常着迷的意思，一般写成片假名。 【例句】 最近bot作りにハマっている。 最近热衷于做机器人。 紐づく（ひもづく） 【释义1】 数据和其它数据关联的时候使用。 【例句】 マスタとの紐付きがおかしいんじゃないの。 和master表的关联没问题吗？ 【释义2】 和特定的项目或客户有关联的意思，尤其是在营业的场合较多使用。 【例句】 佐藤さんって今紐付きあるの？ 现在和佐藤先生有业务联系吗？ キックする（きっくする） 英文kick的意思，软件开发中指作业调度器执行一个job或者命令。 25:00にジョブがキックされる。 25:00作业开始执行。 飛ぶ（とぶ） 【释义1】 消息发送的意思，尤其是指警告或者请求。 【例句】 動かした途端にアラートが飛んできた。 刚开始动就来了警告。 【释义2】 数据消失的意思。 【例句】 オンメモリDBだと落ちたら飛んじゃう 。 内存DB的话关机后数据就没了。 掘る（ほる） 原意为挖的意思，软件开发中有时指做成多层文件夹。 エラーログはもう1つディレクトリを掘ってそこに吐かせて。 再做一个子目录，把错误日志输出到新目录里。 丸投げ（まるなげ） 指不管不问把所有的工作都推给他人。 もうダメだ、あいつに丸投げする。 不行了，全都丢给那个家伙去干吧。 コケる（こける） 原意有跌倒、摔倒的意思。软件开发中经常指处理失败。 ログ収集バッチがコケた。 日志收集批处理失败了。 叩く（たたく） 原意为敲、打的意思，软件开发中经常用于人来执行job或命令（区别于用作业调度器执行job或命令）。 とりあえずpsコマンド叩いてみて。 先敲下ps命令看看。 落ちる（おちる） 原意有坠落的意思，软件开发中指服务器或者进程停止，系统异常。一般多指因负荷过重而发生系统异常，或者叫“ダウン”。 Webサーバが落ちた。 Web服务器宕机了。 回す（まわす） 原意比较多，软件开发中是指处理连续执行，尤其是指批处理等定期执行的状态。 2、3日回して、様子をみてみようか。 执行2、3天看看情况吧。 握る（にぎる） 原意为握的意思，也会用在和其他人事先商定某事。 納期ってもう握れてる？ 交付日期已经敲定了吗？ 切る（きる） 【释义1】 做成目录或者是区分资源的使用领域。 【例句】 /26でサブネット切って使うことにしよう。 用/26子网掩码分开使用。 【释义2】 用JIRA或Redmine等项目管理工具发行新的课题（ticket）的意思。日语中经常说的“起票”也是类似的意思。 【例句】 忘れないようにチケットは切っておいて。 不要忘记开个新课题。 這わす（はわす） 原意为爬的意思，在这里指把网线放到地板下面，主要是表达眼睛看不到的状态。 「ここの配線ってどうするの？」 「床下を這わせます。」 “怎么布线？” “从地板下面走。” サクサク 和“ヌルヌル”相似，页面切换的时候动作顺畅。反义词是“もっさり”。 サクサク動いて気持ちいい。 动作顺畅感觉不错。 ヌルヌル 页面切换的时候动作或过程顺畅，反义词是“カクカク”。 思った以上にヌルヌル動くね。 比想象中跑得要顺畅。 ポンチ絵（ぽんちえ） 指资料中的插图，比如系统构成图等。 今回の構成をポンチ絵で入れておいてくれる？ 这次的系统构成能加一张图吗？ マンガ 和“ポンチ絵”一样是指资料中的插图，但是二者不能同时使用。注意不是「まんが」、也不是「漫画」，而是「マンガ」。 今回の構成をマンガで入れておいてくれる？ 这次的系统构成能加一张图吗？ 抜く（ぬく） 原意有拔的意思。软件开发中经常指从数据中抽出一部分，尤其是调查bug的时候经常会被用到。 障害時刻の前後1時間分のログを抜いてきて。 把故障前后一小时的日志抽出来。 こぼす 原意是洒落、溢出的意思。软件开发中指数据遗漏的意思。 設計ミスで毎日1時間分のログを取りこぼしてました。 由于设计错误，每天都有1小时的日志被遗漏。 突合（とつごう） 进行数据比对的意思。 アクセスログとシステムログを突合して時系列を追う。 对比一下访问日志和系统日志，按照时间顺序追踪一下。 投げる（なげる） 原意为扔、投掷的意思。软件开发中也指数据传递，比如测试中投放数据。 集計APIにCSVでデータを投げると集計結果が返ってくるよ。 用CSV格式向统计API投放数据，就能得到统计结果。 イケてない 不好看。 動くとは思うけど、イケてないね。 动倒是能动，就是太难看了。 着火（ちゃっか） 用英语单词Trigger衍生而来的着火，通常被用做名次或动词，用于比喻引发某种行动，时间或者情况的启始点或原因 そこの処理って誰が着火してるの？ 哪个处理是谁出发的？ ボール 形象地把任务比做“球”，在完成需要多人配合的工作时候，就像玩传接球游戏一样，A做好自己负责的部分后传给B，此时就可以说“球在B手里” これって今誰がボール持ってるの？ 这个任务现在谁在做？ 1. プロジェクトのボールを渡す (Purojekuto no booru o watasu)：意为 “将项目的控制权转交给他人”，表示某个人将项目的责任或管理权交给另一个人。 2. ボールを投げる (Booru o nageru)：意为 “传递任务”，表示某人将工作的责任或任务交给另一个人。 3. ボールを拾う (Booru o hirou)：意为 “接过任务”，表示某人接受了被分配给他的工作任务。 这些用法都是将 “ボール” 比喻为工作中的责任或任务，并用于描述在团队协作中责任的转移和接收。","link":"/working-japanese-notes/"},{"title":"日本のIT職記録","text":"外国人として、日本に働いている。 日本職場のルール 外国人よく知らない常識 ビザについて 高度人材介绍 高度人材ポイント制による出入国在留管理上の優遇制度 ポイント評価の仕組みは？ 高度専門職ポイント計算表（高度専門職第１号イ・高度専門職第２号） 只需3年甚至最快1年就能取得日本的永久居留权，以及高度人才签证相较其他工作签证享有多种特殊待遇。 现在的分数，假设工作三年的情况下 75 学历 本科 收入 假设 400 工作年限 3年 年龄 小于30 日语资格 N2 其他资格 假设公司有加成 10 10 未满3年 0 15 10 软考 5 20 70 10 500w 10+5 满3年 0+5 15 n2→n1 10+5 基础情报技术者 5+5 20 90 这个有点难 10 10 15（可以开个高点的） 0 5 15 10 5 5 20 80 这儿 这儿 这儿 三选二 高度人才签证申请条件 要取得高度人才签证，首先要在高度人才积分表取得70分以上的点数。取得70分以上则可在叁年后申请取得永住权，如果80分以上则只需要一年。 但要注意的是，年收入(非过去收入，而是接下来的预估年收)300万日币是个最低门槛，如果低于300万日币，无论在评分表得到多高分数，都不符合高度人才签证的申请条件。 高度人才积分表总共有3种，分别是高度学术研究分野（高度专门职1号イ）、高度专门・技术分野（高度专门职1号ロ）、以及高度经营・管理分野（高度专门职1号ハ）。 这3种不同分野内的项目及其点数略有不同，但可整理出3个共同项目，就是学歷、工作经歷、及年收这3个，除此之外还有一些特别的加分项目，例如毕业于名校或取得日语检定N1、N2的资格等等。所以门槛或许没有想像的这么高。 學歷 高度學術研究 高度專門・技術 高度經營・管理 博士 30 30 碩士 20 20 大學 10 10 (加分)在不同的專業，取得一個以上的博士或碩士 5 5 職歷(工作經驗) 高度學術研究 高度專門・技術 高度經營・管理 10年以上 15 20 7-10年 15 15 5-7年 10 10 3-5年 5 5 年收/年齡 未滿30歲 30～34歲 35～39歲 40歲以上 15分 10分 5分 0分 未滿30歲 30～34歲 35～39歲 40歲以上 1000萬以上 40 40 40 900萬以上 35 35 35 800萬以上 30 30 30 700萬以上 25 25 25 600萬以上 20 20 20 500萬以上 15 15 — 400萬以上 10 — — 高度人才的特別積分(特別加算) 高度學術研究 高度專門・技術 高度經營・管理 研究實績 20~25 15 — 在公司的職階 — — 代表取締役 10分 取締役、執行役 5分 取得日本的國家資格 — 每個5分，最高10分 — 就職於創新政策所支援的機構 10 10 10 就職於R&amp;D費用超過營收3%的中小企業 5 5 5 職務相關的外國資格 5 5 5 於日本的高等教育機構取得學位 10 10 10 通過日本能力測驗N1或畢業於外國大學的日文系 15 15 15 通過日本能力測驗N2或同等學力 10 10 10 從事日本法務大臣認定的尖端成長事業 5 5 5 畢業於法務大臣所公告的世界頂尖大學 10 10 10 完成法務大臣公告的研修 5 5 5 投入超過1億日圓於所經營的事業 — — 5 從事投資運用相關的事業 — 10 10 关于中国软考在日本加分 中国における試験で次に掲げるもの イ 中国工業和信息化部教育与考試中心が実施する試験のうち次に掲げるもの（１） 系統分析師（システム・アナリスト）（２） 信息系統項目管理師（インフォメーション・システム・プロジェクト・マネージャ）（３） 系統架構設計師（システム・アーキテクト）（４） 軟件設計師（ソフトウェア設計エンジニア）（５） 網絡工程師（ネットワーク・エンジニア）（６） 数据庫系統工程師（データベース・システム・エンジニア）（７） 程序員（プログラマ） 典型的な事例 (1)「技術・人文知識・国際業務」の例 ○ 外国の大学の経済学部において経営学を専攻して卒業し、日本のIT 関連企業との契約に基づき月額25万円の報酬を受けて、システムエン ジニアとして売上管理システムの開発業務に従事する者 ○ 日本の大学の工学部において情報処理工学を専攻して卒業し、日本のソ フトウェア会社との契約に基づき月額30万円の報酬を受けて、プログ ラマーとしてソフトウェア開発業務に従事する者 ○ 外国の高校を卒業後、IT告示で定められている海外のITに関する試 験の一つに合格し、日本のIT関連企業との契約に基づき月額20万円 の報酬を受けて、システムエンジニアとしてシステムの保守・改善等の 業務に従事する者 ○ 外国の大学の工学部において工学を専攻して卒業し、日本のソフトウ ェア会社との契約に基づき月額35万円の報酬を受けて、ソフトウェア エンジニアとしてコンピュータ関連サービス業務に従事する者 引っ越し 引っ越しの手続き 転職について 役立つ税務知識 年金関して エンジニア交流会の話題 有空问一下各位开发者们觉得什么软件好用。","link":"/japan-it-working-memo/"},{"title":"日本語の句読点をざっとチェック","text":"本記事について はじめに 記号 一般的な読み方 JIS X 0201 規格での名称 ASCII 規格での名称 ! びっくりマーク、エクスクラメーションマーク 感嘆符 Exclamation Mark ” ダブルクオート、二重引用符 引用符 Quotation Mark # シャープ、いげた 番号記号 Number Sign $ ドルマーク、ダラー ドル記号 Dollar Sign % パーセント パーセント Percent Sign &amp; アンパサンド、アンド アンパサンド Ampersand ‘ シングルクオート、一重引用符 アポストロフィー、アクサンテギュ Apostrophe ( 左(丸)かっこ、開き(丸)かっこ 左小かっこ Left Parenthesis ) 右(丸)かっこ、閉じ(丸)かっこ、こっか 右小かっこ Right Parenthesis * アスタリスク、星、スター アステリスク Asterisk + プラス(記号)、たす、プラ 正符号 Plus Sign , コンマ、カンマ コンマ、セディユ Comma - マイナス(記号)、ハイフン、ひく ハイフン、負符号 Hyphen-Minus . ドット、ピリオド、点、ぽち ピリオド Full Stop / スラッシュ、スラ、斜線 斜線 Solidus : コロン コロン Colon ; セミコロン セミコロン Semicolon &lt; 小なり(記号) 不等号(より小) Less-Than Sign = イコール、等号 等号 Equals Sign &gt; 大なり(記号) 不等号(より大) Greater-Than Sign ? はてなマーク、クエスチョンマーク 疑問符 Question Mark @ アットマーク 単価記号 Commercial At [ 左ブラケット、左鍵かっこ、左大かっこ 左大かっこ Left Square Bracket ¥ バックスラッシュ、バックスラ、逆スラッシュ Reverse Solidus ] 右ブラケット、右鍵かっこ、右大かっこ 右大かっこ Right Square Bracket ^ ハット、カレット、やま アクサンシルコンフレックス Circumflex Accent _ アンダースコア、下線、アンダーライン アンダライン Low Line ‘ バッククオート、逆クオート、逆引用符 アクサングラーブ Grave Accent { 左中かっこ、左ブレース、左カーリーブラケット 左中かっこ Left Curly Bracket | 縦棒、縦線 縦線 Vertical Line } 右中かっこ、右ブレース、右カーリーブラケット 右中かっこ Right Curly Bracket ~ チルダ、波線、にょろ Tilde JP 。 てん 句号 、 てんてん 逗号 ！ えっくすくらめーしょんまーく 感叹号 exclamation mark","link":"/japanese-punctuation-check/"},{"title":"バージョン管理ツール","text":"はじめに Git Gitを使うためのヒント SVN TFS 優れたコミットメッセージを書く方法 優れたコミットメッセージを書くことは、チームメンバーがコードの変更をよりよく理解し、追跡するのに役立つ良いプログラミングの実践です。以下は、優れたコミットメッセージを書くためのいくつかの提案です： 簡潔で要約的：コミットメッセージが変更の要点を明確に示し、冗長な説明を避け、できるだけ50文字以内に収めることを確認します。 不要なコメントを削除 Remove unnecessary comments 動詞と現在形を使用：コミットメッセージの冒頭に動詞を使用して、変更が何を行ったかを明確に表現します。現在形を使用することで、メッセージがより直接的で具体的になります。 機能の修正: ユーザーのログインバグを修正 Fix bug in user login functionality 変更内容の説明：コミットメッセージには、変更内容が明確に記述されており、どの機能、ファイル、モジュールなどが追加、変更、削除、修正されたかが含まれています。 ファイル構造の変更: 新しいフォルダ '画像' を追加&quot; Change file structure: Add new folder 'images' テーマの分離：コミットが複数の異なるテーマや変更に関連している場合は、できるだけそれらを独立したコミットに分割し、各コミットが1つのテーマに焦点を当てるようにします。これにより、コードレビューと変更の追跡が効率化されます。 機能の追加: ユーザー登録フォームのバリデーションを実装&quot; と &quot;ドキュメントの更新: ユーザー登録手順の追加 Add feature: Implement validation for user registration form&quot; and &quot;Update documentation: Add steps for user registration 問題やタスクへの参照：コミットが特定の問題やタスクを解決する場合は、関連する参照番号、リンク、またはキーワードをコミットメッセージに含めて、コミットを関連付けます。 バグ修正: issue #123 に関連するログインエラーの修正&quot; Fix bug: Resolve login error related to issue #123 絶対的な言葉の使用を避ける：コミットメッセージで「絶対に発生しない」や「完全に修正された」などの絶対的な言葉を避け、代わりに変更の影響や範囲を客観的に記述します。 機能の更新: メール送信機能の改善 Update feature: Improve email sending functionality 一貫したスタイルの維持：コミットメッセージで一貫したスタイルとフォーマットを維持し、チームメンバーが読みやすく理解しやすいようにします。タイトルと本文の区切りや最初の文字の大文字を使用するなど、いくつかの規則を定めることができます。 機能の追加: ユーザー登録ページのデザインを改善 Add feature: Enhance design of user registration page 小さくて頻繁なコミット：多くの変更を1つのコミットに累積するのではなく、小さくて頻繁なコミットを行います。これにより、コミット履歴が明確で追跡可能であり、後で戻ることができます。 バグ修正: ユーザーがログアウトできない問題の修正&quot; と &quot;機能の追加: ユーザーのプロフィール編集機能の追加 Fix bug: Resolve issue preventing users from logging out&quot; and &quot;Add feature: Implement user profile editing functionality バージョン管理ツールの他の機能の使用：Gitなどの一部のバージョン管理ツールには、コミットメッセージのテンプレート、関連する問題のリンク、自動化された操作などの追加機能があります。これらの機能を知り、利用して、コミットメッセージの品質と可読性を向上させます。 ドキュメントの更新: README.mdに新しいセクションを追加し、プロジェクトの概要を追記 Update documentation: Add new section to README.md and append project overview 最も重要なことは、コミットメッセージを書く際に常に後続の読者のニーズを考慮することです。これには、チームメンバーやメンテナー、将来のプロジェクト参加者が含まれます。明確で簡潔、具体的で一貫性のあるコミットメッセージは、コードの品質、チームの協力、プロジェクトの保守性を向上させるのに役立ちます。","link":"/version-control-toll/"},{"title":"面试&amp;自我介绍","text":"f844431ed9d9d0ed4ab18a7fa793fdb2b1b33fe50eb4593869a48095f52477cccf84166b2c0d9f7ebc18409c3caab8d3558e3e5d95790e23e37d7b074eb775292703653ff4a49d6df0c91b879b9eb1e916d21ac9be9b11f08a468d96225be3966f62ed90b925fb44c4c98641c14828289acd3a27e900f765f4d09e01818305bc5a22dbb894a456f4fc8710b206bc64f58753a48da21975f838344f5c8a5169d98f24c9ba18cf9a2815580919fe557d0b4f4a37d7c77df1b5c20101e23ce113b28d1e310246e0c605838dab35a7d0bd2dab3a9cc2085d35d3e9fb5ee1944f17cb673d109ff009c58e8318176f6fb13ecd66859176423c03cd028d7cc1fb9d6c95424ead07e32d16ac371ae715222b90b473e16f5dfdf69eb02b9e63b417cadcd1c2096d24ae30e4787811b7ac6ed2b60429ac9c9fb1517e72bc5e3ce9fbbdd40a0a10873ecfdf123a4b35158759976ab51c58dda8281d87884ac814987e682d7983fbd828c81fb3c8b0d4a2552a78c34cedcd4d721bd242c24bcbf86e0c4c8ad2d5e8c28b2a04e7dd60f5dc318dc198d8dee52ce13c0dfcb7e901ee6a30738f3ed9669aeeaac9819218929887c3b1b30bf74cc85805b0bb66c76f61a9a6690cc18489b8634136466e8c621bc454be94a11b55cca771742e14b889aebbb4ea1512fb571b97bd95fdf7334ceb39cfe97c677284314e555116c73837e26685043ac60dfef9bf7a5ea25a94853d87a24317547318265e0eb9803d5d66ac0a25319e7ba769c7bf2e524843d62bdd1ec1867fe8f769977dd3825a655ae854d7301b6deaa8ff3f216712a8f244f84d7e64485fc1de00965f867d6bcf4930adc92072e7fb13379a0f25d2b433b9862151aad1c0b2bf4a9010fa4f5d1aaa7d6d66ab91d7117cf231202201b044b466f37cfc11df1569e62093afd59800b5bbe8ee4afd6ef1593d3c317f947654b868881a034a97a441c91eb33353302809c61c391b25cc9d94d2750b5e7db26272f1f80339a97972d1734d372609dd8744f237a9fa04422e50a2b46a0256b698c4e1f986410815066a7b493a8f3b73c0a0811b4c96b3c0c330a5c58e809cefd4b3bb3e98dfc2f281fa75df76c8eb50428d2b8553fcc9d1f46db5a3a1b98536e588f0298be0694607fd8de32f2c415bd97cbf7fe5c026fdcdfc42b2b543c142352555d88223dc95ac388f85828e1c0378e0ee3033959ec97fafaa1e22519d6b6aac35812cf483fe41d4353df8c8367a8a9607c5554af240433e2ab644f9b69d14952950951f1bd8f55a42a2989932629c25db46d212ebd9e2374922e0237ff235c810954264581b6f1d97eb0582dc0678abea621aa7c18adffe4efb6a3e0f397a179f30019c14ae6dac8bd9dde34bb92ceb0c9ee9d850014c208dabed40e475f32eaa9863da4491ce750df243d9e172d424950b6fb7eefdf40e018b713c837ef8719ed4251f0e1cc7fe45ba8ac3812b31d22aec3744ed6575f1f32d277e2540dd5a6a8947b6feb9bac25bca732f2064aa9286ce5c63cefa9617159478e9770cbd40d1027d5504173391f379feae4fcf02c3e8ff5126c9535808ee93cd801ac98d0bf74b346591ea9d45b361d23403bb478905f126b7f2f17810b3d5807c0dc345d05dcd70823b58b1ef3d169bed225016e5cda33c714036bd50645ebfebd148c0a242b5d9943f1bd81e4ba9f8d1bb958eff85a331adc51badc953e87898c11010f7b7400dd5984ec822bb1201bedd066b76fb8a1d8603838ca47ad30ff7f6dea90ff047baa9d78d67122ec42a43ec7fb43f3106c5ea559d45a91c912abde349353cb699b3149a9058b9561510458669eda5105c48b5314908bf19f2b590d3a6e92c736930181c17d8ade19c5fc856311f0905e42e50e3f0a042c94471e65542696aa1bb60b801855f81817c61474afc57b79c61b9426a32e2eb14e27a16465e133a2881b95d2c5ce298f73e80fd3cac442e832f508f9a2a086ccf53d8bc80e8997fd547e6390227e752dd6b40919755be7b9de7da36af9f4318294c123d4042205db6648f28e5fa0601c29305f21708fa2e035d2d0743648b9d946a807657eae17972dac3a944bd7bad65aaf8f686c4680bc0113b6c7f69cf70a3114c95502e707633720803b263fb71f154eb2d5da91a25531c614d6139d89853967afc59d350ccaf425edfb4ef2ef4a41be48a226454edfcb1490f641199ebaddd851794653c77106c33e01fa71699c350ada57f4f060ce542d7aec0be0c1ce80878b105d56da014ec9d6c558d878a2e5c05583c9f3dc36a7a7fc112b6854be58655d4e0fdd9eaaa2201e7883e820d788de2dec1e4ef3b828bcc0195c8a9652897eb81d023c93ee8c9b16311d11f9408a56c06b9685936adc9f223cc3babb145e15965015a0f784521af2b40337866717429f7b38ad892e74bc0b15d9bd81321a354d719d92a9bcc0e24629ceae7bae628bac04b4684a9de025c27e9993ac24719a595514840110a1abcf5600048c360a74ac177db323731aee90f1d3ff894f14ed9ef1391db96b9743464094ee868c1b2704eeeb38623bcbb891c0e85b31fa512f7a035032b513476bb4b5e45b723e5191c5e55677a50f2e723a3a82c0fc00e3649158c2cb022651ce5555766112b05e5441e333cb3525d844cafdc668e3e1af2e9a43d9ccd21d3f4b240af61585bfd27282b6ef6c146bc72f9117a56b0eb76e3b68add544792d6ed93071cd13a1a26963aaf6bb49eca522ca8b2419232f9f2975cfde2ac53b0cb13cfa421f696e89cc274d6d7439a0dc23fd1c4e3be052ed464322ff33bc49530b7cf3e6a215585d603a1d65a5c4343d42ea798a90c495a69c57a714a46cb22a7f1dc05e784ec3625f4388cce6cb3875da57cb9d060e651ee6f5b4ae2465cb5431a507400b4b0ee5e72efc80bc33de44b5c8f7ad1e8729ef59171c005519d2179f935f03961619f8efe1f7ccd9488b29c5350bd65591d519ca26e4735b8496abedcd6dc21d437e2b1cf784cffa5a47470851ed436309cb551a85f7132924d34108fe7e89d377ae77931dd5826b4e9c2be2cce726041d6e21aebd9783531ad3295b0de18dc520f5c43f0ca3c8d8b8c6869a1ffc98aa20f5eb5c7087e70cba709fb5da4e6287a4ea377426b1b2b22dea141bd003a47157469aa43ccce9b740f409291df84fe62f5eea7d130db3c38ac70d823a25cd46aa1dbaa75e892a43ed3196504f81de555f2ee9847d6d6b446c77fd4245952402fbea8b1835aa190bdf91adac54b148a284ada17420c8ec84b473549b92914c7a7113d358909b0859f7d94f2da97027b0ea103845961d64e41597ee7baaacbe785db8e96a69ac458139bd160a07fb0a1d5f73d2e5553197a5c664f894c36cdb2c5516b32dd6ae0e29d4d0b321e35d11f9b2f9deb7233e1ac00db27ce950a4bb24100f61a11e20c613a73972d1505f0324ed702b0afe4593059d9daef81c937a71ce09b832f83837475fc016c330710d95b7a0e5493d6de9c9b7f1d5a1dcb83b2278b1f61719f30e9f41087befbbe1bda882908d8be15dfe8b9164fd3d3f617c0fa9a8ef5a631906d7b9e3719c2c99a2081c86061adb8eb6a03793e0c45a72dc40f521238c71005516aee1fc8aa71155eca40ad97c5c0992196107b84a1704949ca23f138720cbce04525e51a86bac0b9722d3f5a30ee07167acfc3267da0c2698c5e1ce6b0153ecc36f806be58a7b2dfe6efacc9e828a41d002bc746ea99b8704f83d704e899aa0614998673b97ca6f8d5295bd00a2a3754df77223ae87c7419cb6bae87e2629745c060c597ec779428f50556abe0455d8cf31f78d39f2b236679ebe348944bb736746769f80020cdf11ce2480b80b3f3375a4342f582c9898244b7e78a0d8cec327e8dd1bd6bfa559e377b4757da463413a254cf08a87e805321c7508ead8f6ffb57e4093b28380334c0f35e30d1944282dfe0763deb8abb0feba5d2342f09a82ca00b48bd9340973a4be3cdf19fa9bc70f7f3b3a3d44cf2992719928b89001dc5e674fb58ac7413d9da19a56bbe58241c3a182bdf575df1a2de5523867a9d9a2a6ee7ac34b409c7bce6e647c240fa6656985c3580ca720b222096797fe9978c2f7114179476dc034f19f377fe8c95277fd0eef165491568425614b20c6c379f38bc38cc3ee8834bc52ab18a98c7bd95e97b46b2b19b4f2afd45378ab3ccda7d35f0f703c09a502a81a0169f3c4521ddefbf068205f967a0233d0e33cffe6e4d6780e83001ca23b9c44aaf96014ddb26e076834f0cdd25c9cfbb8162c5cac015512b74e407458ffdc3aa020ea8bf272b5798872eec2397126f16b827f328b19709846185b4050ad4dbebc73e647c7b85f356d5f1006dd8fcb3760e73c6cbc7c82b3f6381a2966bfca0c92bcd58809bc1552fd7b30d4d59912af183ea64724b730b357ada94f9e6b15630dbac5c6c66c7729deffcf8d00ecedc54b4816b1176896ca4dd77e6b57a0984ab255a4e184d5158821865967533320f44d90f517ea422d472a50ffced88d81575397d9d116a6e4f13ec8827696b232c1779579c39cf2bfe94fa7500b2560914c2129e3c8f6bbb8800ce03dd9fc0d2213af8290b8e0516912b5b321e0e984c9173c13d7afd8b7d9308a89251be98e5ce52ec2d4e9e8acd1243362864337e83c61340f4292c3161435a1018697cb01bfe88e9c3e0bd5370f9487620aaa515309cbd8b15d933fdc18f9f628f193c9f2ce7035bc8dbb9c57c06b79d436549f6bce59a294faf91f56e2d298f7372118fc76781d394c6c15c268653bcd3bb1182c1ab1edf76b2810b4e3d0fbbda474d251d1ae22614ddf2b8af19d84ecaeb7a3675f1ab64f8ea4d40c09c7c9bc848913d5906107f68b871fbc8dd43d26a1319b99ecd74e1098ac327003f8aff4bf5f9e0e0ce65fbd5e1f0d9994b37d3a5cf955a8778665dfd3aff1b96929b9630fb5f83fd7fe28a3993f1db5faad4bf88fbc27f941589089ff8b79abaea749bf4cd37e5e6043d1e9072c9a2013e6e86bf68f863ca538472118e650e489c74bd9a62a4eb97d8ef588287b8f4417bdff07dba2aeb64581968b84f905f05fac7c2f1f52f29b312a136eb5a0c7f4701e95a4c15e8542cb2f9934e8d31684e1d0ef74d548ca65dc91a311f01c84f1d8283b9eda721f009e957d4cf71ca1d474b7976e6d8f230302488061370c54c33a18b0f1bea536035439e39f523718674c6892b947d31671a0336ae1b09ae6a15c3d2f5796759dc1c5b8de5a8d9043400618d14459f75f0081c55a6ab4fb232d4d0b96aaca4a672282e259f244fd7076aed182c2e6daefeefada79944b3fe39ef96187e7b47f0104bd87450c79e97a748dae9fc4b97bc888b24b8984d3b65ef330c74393a35b83080344485c7a90ef110251f8f2a58f89b90b0c04ecc62238f9cac4f16bf1331157cc709fb1937038c5816aedff03922dbc36dbdce0f4699566209d1ab1b7db681243e61d4580f61df834ce0e445e420611a10aab4024ab1e5b8b7e12c33e5ef0191e01ad883813176220ec9fcddf41e4aa88b1c3fa9322b443b26aef47b2de4046ae09c14b933af414c77770c52295daa2e95afe3252bf206896ac93024374f8bde2aa4c0f4db57b8fecb67a0f52239d89a219e1890eaf46cf05af21d190b8d02129e9748be1e28a6d9ef1bdd37f55820b325bebf105dba373a5d3acac3e368240ba958d773d5b76a3bb8d797bc8bc39d88818b643c4bf04b09bb89283c4138a6312bb2888347398ebca35d3a2db7afe7cdc1c1c969480cdcfb1060072dbee0ce22de44ec27760bce125620d6be309f12ca0ff3e5bccbc7819a5015a4985c103e92858482555a2ceb59530bbac860bc4170370f3c45f63ba8078adce2e8d9c3a37de0a34ce84df5271fbc2488783380605f1d58f8ec1f52e2110137e2f544df7de330ef94f65a29b79240a906e9bcde4f9f730a87713fa50ecbd212d46e9be416d13d5c1b9d415b87a0fedc4544eac50c66b3a2078fa246ebac770eb002ed3ae890331dcb85004764daacc1d0254e157eb6654a183d44ea39e093177f670d7fd2e9b2908135f4e36c4a6f7a312035f744dace51293e97ea0450131408cc8b5c9920547baec3063adfcd679c94e349d30db93287a106638f4fd81cf44fc0c6fdfbf503dfa4bc7dac13787ecdc9f6c41dd87678325f2cde845f0d3465cf0d88601467b1d79d4ab4d70f4feb28846e89e2e10330aaf01288a04391bb97efdd45fe9c19629c18bbd0407bc39dd0c620f00e45e92b4fd7e1fbacdee9e58d2254a60614eb220c16a9395f1e648778cafc9d379e215c98cb79459b5cd412bef91c1b068a850067ffae30e35509d2382dac712820d1f1a6690de12d2952d9a454291611ed4e93e14db94fc89c7d563448c9b3256e9a3d4cdb08997b3d9857d8062771972c3b255d457659103645172a33f1249cb04bb598d8af4444fba62095e3dcc86b9ca528da12ea2c3bb977582ecaf9705e7c0b7ea2e688cedd0be9acdd7b8e830b6fc6ffe0454336c0eacb0432ed6655fe49df75e6dc215c30ddb012e5dfa0c8d85fe06bc7e967b4ad14edccc5ed6d453f2a59c36f16eb922c4e161847181e9a778b794356c405a259155d2a32569da232c33644a236891dc0237c52840d2a15fe54a2b4660243535f699e76d0ef0a6e3986c12a5586e59da31a0a5e694adabd65d76ba104efe8001fcdcd0005f1a574c6b4204f08fee080777b665e0ec8829b1e35f11b803a00f37eb4a8312e4895dd2a4e73a632d555ce15e50043d1da626690c69b14c74a11e3ba5e4e8ada54075abe13783ebe9321fe8e067cb067e7a48b56d5d835cb0356c53ec4a2218abfb3f27b4806bed266b9c2c054b7cb3b36b5abaf22c95f0c768a25c187d38181374fa20be7172b85192a34f10c6e29f836f313c591890bae478b26aa27fc824ff640225d486dd3f462bfa8840ad390d89337b932edf864ae79dabdae8f429d62c7d483eae1fbd737552f6519c0b2bc6733e20da2947134b8fe0cf17eb1dace8bcf5e6c5d103f3494385f113b3b1e7311a3fad1efda1ad7faca0b70b00643a1f74957c49ee959ce7813ac8499d8cb5aa8936f43873285a1a40d0e9fc0c1311c44bcc546de2beb5387a48badbf836ea6666dc37eaf090efd30e7b3d3c119cf64eba05a5f0d842ff291c6c69d351db576af2eb4fc76f7de4faab833def6f0ccee1d7fca8f548c21df1c313ed2023b091526da4204d10ebd0d6a10004770a4b75c0c49371b65298dfa205b2a3e193722b2888fe5c5540435d9952a39379cbe546471ccafa5b3bd26a6be9a8ca35ae48dc0a1eab32300dc1f1efc37da83acfcf5fa66f0d93814b89dbc7e4b0b5e7b1b5fd1b09c121baea08ae3422c86ac61cc6fa612648c7693cc10316ba311377648206af76f6a0364403f2104a81b33df5e3e3815754463dafffdfa55c0f9ee81523ff887fca5c9e8c7ee1ae052899555032224feb370feb145aa1b7380094f920b54f74c1a15281b8a94eab5de45cba6d63e13398f144835125e0a955a3e1a8205ce549cdecc8bfc382c1111d880b3a629043b266a9c40bd8f4d02e7edf7c663eb36469474734d04c08b8266bee426c0063a3e8c2017bdb27908e8cd407932ea80dc4b1856cc460eb0f34caec73d50ae22999e181cc385367f7498b2e8ddec9c5d74a7fbaaed75f24af0ad1a2c424cb2f44a6b24f2c8002850208d92c5e1489c1505494ec1602048fe420b789fcee77fed0b387657790db30d29f482f42ff5fdcda2121d87d9b0cf0f4df05ae4ec1cb847d96e793ba07b2a7353117814c0b24934f62c8b31e24b4f2eb01ae3c8ac75e442cc6cb7107c5396baa13f1798 こんにちは、ここではパスワードが必要です。","link":"/interview-and-self-introduction/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"markdown","slug":"markdown","link":"/tags/markdown/"},{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"sql","slug":"sql","link":"/tags/sql/"},{"name":"設計","slug":"設計","link":"/tags/%E8%A8%AD%E8%A8%88/"},{"name":"work","slug":"work","link":"/tags/work/"},{"name":"Git","slug":"Git","link":"/tags/Git/"},{"name":"CN","slug":"CN","link":"/tags/CN/"},{"name":"JP","slug":"JP","link":"/tags/JP/"},{"name":"外国人","slug":"外国人","link":"/tags/%E5%A4%96%E5%9B%BD%E4%BA%BA/"},{"name":"TODO","slug":"TODO","link":"/tags/TODO/"},{"name":"開発メモ","slug":"開発メモ","link":"/tags/%E9%96%8B%E7%99%BA%E3%83%A1%E3%83%A2/"},{"name":"日本語メモ","slug":"日本語メモ","link":"/tags/%E6%97%A5%E6%9C%AC%E8%AA%9E%E3%83%A1%E3%83%A2/"},{"name":"作業メモ","slug":"作業メモ","link":"/tags/%E4%BD%9C%E6%A5%AD%E3%83%A1%E3%83%A2/"},{"name":"単語","slug":"単語","link":"/tags/%E5%8D%98%E8%AA%9E/"},{"name":"雑記","slug":"雑記","link":"/tags/%E9%9B%91%E8%A8%98/"},{"name":"ツール","slug":"ツール","link":"/tags/%E3%83%84%E3%83%BC%E3%83%AB/"},{"name":"エンジニア知識","slug":"エンジニア知識","link":"/tags/%E3%82%A8%E3%83%B3%E3%82%B8%E3%83%8B%E3%82%A2%E7%9F%A5%E8%AD%98/"},{"name":"クイックチェック","slug":"クイックチェック","link":"/tags/%E3%82%AF%E3%82%A4%E3%83%83%E3%82%AF%E3%83%81%E3%82%A7%E3%83%83%E3%82%AF/"},{"name":"AWS","slug":"AWS","link":"/tags/AWS/"},{"name":"Infra","slug":"Infra","link":"/tags/Infra/"},{"name":"CI-CD","slug":"CI-CD","link":"/tags/CI-CD/"},{"name":"Spring","slug":"Spring","link":"/tags/Spring/"},{"name":"Java","slug":"Java","link":"/tags/Java/"},{"name":"Backend","slug":"Backend","link":"/tags/Backend/"}],"categories":[{"name":"作業","slug":"作業","link":"/categories/%E4%BD%9C%E6%A5%AD/"},{"name":"作業メモ","slug":"作業/作業メモ","link":"/categories/%E4%BD%9C%E6%A5%AD/%E4%BD%9C%E6%A5%AD%E3%83%A1%E3%83%A2/"},{"name":"仕事ノート","slug":"作業/仕事ノート","link":"/categories/%E4%BD%9C%E6%A5%AD/%E4%BB%95%E4%BA%8B%E3%83%8E%E3%83%BC%E3%83%88/"},{"name":"勉強ノート","slug":"作業/勉強ノート","link":"/categories/%E4%BD%9C%E6%A5%AD/%E5%8B%89%E5%BC%B7%E3%83%8E%E3%83%BC%E3%83%88/"},{"name":"テクノロジー","slug":"テクノロジー","link":"/categories/%E3%83%86%E3%82%AF%E3%83%8E%E3%83%AD%E3%82%B8%E3%83%BC/"},{"name":"設計","slug":"テクノロジー/設計","link":"/categories/%E3%83%86%E3%82%AF%E3%83%8E%E3%83%AD%E3%82%B8%E3%83%BC/%E8%A8%AD%E8%A8%88/"},{"name":"ライフスタイル","slug":"ライフスタイル","link":"/categories/%E3%83%A9%E3%82%A4%E3%83%95%E3%82%B9%E3%82%BF%E3%82%A4%E3%83%AB/"},{"name":"日本語学習","slug":"ライフスタイル/日本語学習","link":"/categories/%E3%83%A9%E3%82%A4%E3%83%95%E3%82%B9%E3%82%BF%E3%82%A4%E3%83%AB/%E6%97%A5%E6%9C%AC%E8%AA%9E%E5%AD%A6%E7%BF%92/"}],"pages":[{"title":"","text":"google-site-verification: google336114c45a30c979.html","link":"/google336114c45a30c979.html"},{"title":"自己紹介","text":"","link":"/about/index.html"}]}